{
	"list1": [{
			"title": "数据自治，未来已来",
            "yanjiang": "时代飞速发展，数据毋容置疑会越来越重要，甲骨文的数据技术一直是行业的领跑者。万物互联的重要基础是数据，客户的核心业务也更依赖数据的可靠性、实时性、安全性及易用性，甲骨文的数据库一体机 Exadata 经多年的市场验证，已成为行业领军体系，为众多客户的核心业务的高效运行提供强大支撑和保障；甲骨文的自治数据仓库 ADW 也以其超强性能及简单快捷构建的优势能很好地助力客户的数据查询及业务波动快速分析响应，为客户的业务创新提供了简单高效的业务数据平台。",
            "post": "吴承杨 甲骨文公司副总裁及中国区云平台总经理",
            "jiabin": "2010年加入甲骨文公司，现任甲骨文公司副总裁及中国区云平台总经理；在此之前，曾担任中国区技术产品部新兴市场行业总经理，新兴市场包括：城市商业银行、农商行、证券、医疗卫生以及教育等行业；拥有26年的 IT 从业经验，在加入甲骨文公司之前，曾在惠普，戴尔和 DEC 担任重要职务；获得计算机硕士学位以及马斯赫里赫特学院的MBA。"
		},
		{
            "title": "从达梦发展看中国数据库四十年",
            "yanjiang": "达梦作为中国数据库行业的实践者和推动者，见证了中国数据库从无到有，再到百花齐放的四十年风雨历程，在这个过程中，技术路线如何选择？人才团队如何培养？造血能力如何提升？市场需求如何挖掘？为此，我们和大家一起探讨中国核心技术的创新突破之路。",
            "post": "冯裕才 达梦数据库 董事长",
            "jiabin": "华中科技大学教授、博士生导师、武汉达梦数据库有限公司董事长，中国数据库标准工作组组长。国务院政府特殊津贴，国家有突出贡献的中青年专家。"
        },
		{
            "title": "华为云数据库体系及优势解读",
            "yanjiang": "作为公有云市场的后来者，华为云数据库产品架构如何布局？作为第一个基于 MySQL 8.0 开发的新一代分布式数据库系统，Taurus 架构上有哪些优势？计算层和存储层都做了哪些优化？本次演讲将深入剖析其中的技术原理。",
            "post": "牛哥 华为云 数据库资深架构师",
            "jiabin": "牛哥于2017年10月加入华为加拿大多伦多研究所，目前担任 Cloud BU 云数据库资深架构师，有20多年的数据库内核开发经验；2006年1月加入 MySQL，任 MySQL 存储引擎开发团队负责人；2008年加入 Oracle 担任 InnoDB 开发团队负责人；还曾担任过 Oracle 云服务团队 MySQL 云服务高级顾问，Twitter MySQL 内核团队负责人；拥有多项美国专利，曾在多个数据库会议上做专题演讲。"
        },
		{
			"title": "云时代数据库的演进",
            "yanjiang": "在云计算时代，云原生数据库开始崛起，因为弹性扩展、按量付费等特性获得了大量企业用户的青睐，挑战 Oracle 等传统数据库厂商的位置。为了满足弹性扩展、弹性计算、以及按需按量付费等云上应用需求，云原生数据库需要利用软硬件一体化设计，基于新兴的 RDMA、NVM 等高速硬件，研发全用户态的 IO 与网络协议栈以提供极低的延迟。同时探索新的体系架构例如通过 shared-storage 来实现 shared-everything 和存储计算分离，提供一写多读的扩展能力。<br>在某些高并发、对水平拓展有强需求的应用场景下，云原生数据库同时也需要探索基于 shared-nothing 的分布式架构来提供分布式数据库能力来处理分布式 SQL 查询和分布式事务处理。同时，金融级高可用、异地多活等技术挑战也是云原生数据库所必须提供的关键能力。<br> 阿里巴巴数据库团队自主研发的存储引擎 X-Engine 充分利用数据的冷热特性以及计算机系统结构的分层内存体系，通过冷热数据分离存储技术，提升写性能的同时降低成本。基于对以上技术挑战的不断探索和实践，阿里巴巴数据库团推出了云原生数据库 POLARDB 和其分布式版本 POLARDB-X，经受了2018年阿里巴巴双十一的交易峰值挑战并在阿里云上取得了商业化的成功。本次报告会基于我们近期在 VLDB，SIGMOD 上的论文内容，结合我们的核心系统设计原理，来介绍云原生数据库技术的挑战和发展趋势。",
            "post": "飞刀（李飞飞） 阿里巴巴集团副总裁、高级研究员，阿里云智能数据库事业部总负责人",
            "jiabin": "阿里巴巴集团副总裁、高级研究员，阿里云智能数据库事业部总负责人，ACM 杰出科学家, 犹他大学计算机系终身教授；曾获 ACM、IEEE、Visa、Google、HP、华为等多个奖项，获 IEEE ICDE 2014 10年最有影响力论文奖、ACM SIGMOD 2016最佳论文奖、ACM SIGMOD 2015 最佳系统演示奖、IEEE ICDE 2004 最佳论文奖、美国 NSF Career Award、中国基金委海外重点研发奖等；担任多个国际一流学术期刊和学术会议的编委、主席。"
		},
		{
			"title": "数据的价值和数据库发展趋势",
            "yanjiang": "数据库的核心能力是存储数据和计算。数据为什么有价值？以提升价值为导向，数据库会怎么发展？<br>分布式数据库和计算存储分离数据库哪个更好？<br>TP 和 AP 系统可以真正的融合吗？有哪些技术方向来解决 HTAP 的需求？<br>混合云提供的是什么样的用户价值，混合云是否可以满足这种用户需求？<br>本次分享以提升数据价值为起点，讨论数据库的发展趋势。",
            "post": "林晓斌 腾讯云 数据库负责人",
            "jiabin": "有10年的数据库开发经验和6年的云数据库服务经验；在数据库高并发解决方案、性能调优和 MySQL 内核开发上有丰富的经验；活跃的社区开发者；《MySQL 实战45讲》作者。"
		},
		{
			"title": "TDSQL 的全局读一致技术",
			"yanjiang": "TDSQL 是一个金融级分布式数据库，源于腾讯的 SP 业务，经过十年的积淀，于2012年正式诞生。发展到今天，TDSQL 逐步实现了微众银行私有化部署，上腾讯云，上金融云，并且为全国多家传统银行和企业提供可靠的金融数据库服务。TDSQL，具备完善的金融数据库服务能力：能够保证强一致下的高可用，拥有灵活的全球部署架构，实现了倍数提升性能，增强了 MySQL 原生的安全机制，能够在水平方向上分布式扩展，具有自动化的运营体系和完善的配套设施。TDSQL 构建了创新的全局读一致模型，但不仅限于此，还创新地把全局读一致扩展到了全时态数据模型上，为全局的查询、备份、金融对账等提供了强一致性。而且基于此核心技术，实现了分布式数据库全局闪回、HTAC 等有价值的特性。",
			"post": "李海翔 腾讯 金融云T4专家",
			"jiabin": "网名“那海蓝蓝”，腾讯金融云数据库技术专家，中国人民大学信息学院工程硕士企业导师；从事数据库研发、数据库架构、数据库技术管理等工作20年；历任北京人大金仓研发中心多个项目的技术经理、测试部经理、测试中心总监 Oracle 公司 MySQL 全球开发组 Optimizer Team 的核心开发人员；历任北京华胜信泰数据技术有限公司，架构部 leader，首席数据库架构师，兼研发中心副总经理等；对数据库的内核有深入研究，长于 PostgreSQL、MySQL、GreenPlum、Informix 等数据库的内核与架构；近二十年的数据库研发经历，先后成功主导开发有数据库管理工具套件、JDBC 驱动程序、数据库逻辑备份与还原系统、数据库物理备份与恢复系统、数据库安全审计系统、数据库查询优化器、数据库自动化测试系统、数据库性能测试系统、数据库监控系统等多种数据库相关软件系统；技术涉猎极广，涉及数据库的高可靠、高性能、高可用、数据库安全等各个方面。业余时间喜欢分享个人心得于博客（http://blog.163.com/li_hx）；出版有《数据库查询优化器的艺术：原理解析与 SQL 性能优化》、《数据库事务处理的艺术：事务管理和并发访问控制》，广受好评，被机械工业出版社誉为数据库界的屠龙刀和倚天剑制造者；申请国际、国内专利20+；2019年1月，高等教育出版社，合著出版《大数据管理系统》。"
		},
		{
			"title": "GoldenDB 事务一致性处理机制",
			"yanjiang": "GoldenDB 是中兴通讯推出的一款金融级交易型分布式数据。本主题针对金融行业关注的数据库事务一致性问题，介绍了 GoldenDB 的解决方案和对应的优化实践。",
			"post": "陆天炜 中兴通讯 GoldenDB 分布式数据库架构师",
			"jiabin": "陆天炜 中兴通讯 GoldenDB 分布式数据库架构师"
		},
		{
			"title": "OceanBase 查询优化器的工程实践",
			"yanjiang": "查询优化器是关系数据库系统的核心模块，是数据库内核开发的重点和难点，也是衡量整个系统成熟度的“试金石”。查询优化的理论诞生距今已有四十来年，影响优化策略的各种硬件因素 — 包括 CPU、存储、网络等等 — 其变化可谓“沧海桑田”，但围绕查询优化的核心难题始终没变 — 如何利用有限的系统资源尽可能为查询选择一个“好”的执行计划。近年来，新的存储结构（如 LSM）的出现和分布式数据库的流行进一步加大了查询优化的复杂性，数据库的开发者该如何应对新的技术挑战？本报告将结合 OceanBase 数据库过去几年的实践经验，与大家一起探讨查询优化在实际应用场景中的挑战和解决方案。",
			"post": "溪峰（王国平） 蚂蚁金服 高级技术专家",
			"jiabin": "16年加入蚂蚁金服，负责 SQL 优化器的研发工作。2008年毕业于哈尔滨工业大学，2014年在新加坡国立大学获得博士学位，博士期间主要研究方向是数据库领域的(多)查询优化和处理。在加入蚂蚁金服之前，曾经在华为从事数据库的研发工作。"
		},
		{
			"title": "POLARDB-X 架构和技术演进",
			"yanjiang": "POLARDB - X 作为阿里自研的新一代分布式数据库，支撑了阿里巴巴90%以上的在线数据库应用。从 AliSQL 到 POLARDB - X，经历了怎样的思考？在过去的一年，POLARDB - X 在技术上有了哪些演进？希望能在 DTCC 的舞台上，跟朋友们进行深度的分享和交流。分享大纲如下：</br> 1. 基于 Paxos 的高可用。Paxos 协议大家耳熟能详，但是从理论到实践，从实践到应用，有很多值得交流的话题；</br> 2. 自研存储引擎X - Engine。X - Engine 在阿里内部的应用逐渐推广，并且基于X - Engine 撰写的 Paper 也被今年 SIGMOD 录取。本次分享，除了带来X - Engine Paper 中的若干技术创新的现场解读之外，更会跟大家 share 我们在打造 X - Engine 过程中踩过的坑、积累的 OLTP 存储引擎打造经验；</br> 3. 基于 HLC 的分布式事务。分布式事务是分布式数据库最难攻克的技术之一，为什么我们选择基于 HLC（ 混合时间戳）的分布式事务实现？HLC 能实现什么隔离级别？HLC 有哪些工程上的注意事项？",
			"post": "圭多（何登成）阿里云智能数据库事业部资深技术专家",
			"jiabin": "阿里云智能数据库事业部资深技术专家，DTCC 的老朋友。从2005年开始一直坚守在数据库内核研发领域，先后在神州通用、网易和阿里从事数据库内核产品研发工作，目前带领团队打造阿里新一代分布式数据库 X-DB。"
		},
		{
			"title": "基于 MGR 的读写强一致性数据库",
			"yanjiang": "介绍滴滴自研基于 MGR 的读写强一致性数据库架构的设计思路及应用实践，在集群维度提供全局读取一致性，为金融交易场景提供了一套完善的解决方案，以及在 MGR 方向上的服务化实践及后续规划",
			"post": "田佳伟 滴滴出行 中间件开发专家",
			"jiabin": "曾就职于百度、Thomson Reuters 等公司，现就职于滴滴，负责数据库产品的架构及研发工作；多年中间件和数据库开发经验，研究方向主要为分布式数据库系统的理论与实践。"
		},
		{
			"title": "瓜子精细化运营平台的应用实践",
			"yanjiang": "随着二手车行业密集的广告营销，品牌广告的获客能力逐渐达到瓶颈，存量市场的用户运营变得愈发重要。大数据时代，我们可以轻而易举地获取大量的用户数据，比如用户的登录/注册时间、搜索/浏览了哪些车源、实地查看了哪些车源等等。有了这些数据，再结合人工智能和机器学习算法，我们能够深入分析和挖掘用户的特征和偏好，并针对不同的用户进行个性化的精细运营。本次演讲主要分享大数据和人工智能在瓜子精细化运营平台中的应用实践和落地经验。",
			"post": "周家帅 瓜子二手车 资深研发工程师",
			"jiabin": "北京大学硕士，瓜子二手车资深研发工程师，曾就职于宜信大数据创新中心，2016年中加入瓜子二手车直卖网，目前主要负责瓜子基因图谱大数据平台的建设、以及大数据和人工智能在瓜子二手车和毛豆新车业务中的落地和应用。"
		},
        {
			"title": "AI数据中台Mega及其应用",
			"yanjiang": "随着 AI 在各行业落地的进一步深化和应用数据量的飞速增长，越来越多的AI科学家痛苦地发现数据 ETL、数据仓库和海量特征向量检索等数据处理流程花费了他们大量宝贵的时间和精力。AI 数据中台 Mega 打破人工智能和数据处理之间的分界和壁垒，提供 GPU 加速的一站式AI数据科学解决方案，将数据 ETL、数据仓库、模型训练、推理和部署等多个流程进行融合。在实践中，Mega 成功地帮助 AI 科学家将工作效率和产出提升5~8倍。",
			"post": "星爵 ZILLIZ 创始人兼 CEO",
			"jiabin": "星爵是 GPU 数据库公司 ZILLIZ 的创始人兼 CEO，是数据库、人工智能和高性能计算领域的专家。他曾长期就职于甲骨文(Oracle) 公司美国总部，负责其数据库系统的核心研发工作。他作为奠基人之一研发的 Oracle 12c 多租户数据库(Oracle Multitenant)被誉为 Oracle 数据库在过去10年中最具革命性的创新，迄今已经为公司创造了超过10亿美金的营收。他本科毕业于华中科技大学，在美国威斯康星大学麦迪逊分校获得计算机硕士学位。"
		},
		{
			"title": "餐饮娱乐领域知识图谱的构建及应用",
			"yanjiang": "作为全球领先的生活服务电子商务平台，美团点评拥有围绕吃喝玩乐全场景的丰富数据，通过使用深度学习技术以及自然语言处理技术，对这些跨场景数据进行充分挖掘、映射、聚合与关联，美团 NLP 中心构建了一个全世界最大的餐饮娱乐知识图谱 — “美团大脑”，来促进每个场景下应用服务的智能升级。在这个报告中，我们将介绍知识图谱的行业现状、“美团大脑”的构建方法、以及目前在搜索推荐、金融平台、赋能商家等方面的一些初步进展与落地场景。",
			"post": "张富峥 美团 美团点评 NLP 中心的研究员",
			"jiabin": "博士，担任美团点评 NLP 中心的研究员，带领知识图谱算法团队；目前主要负责美团大脑项目，围绕美团吃喝玩乐场景打造的知识图谱及其应用，能够打通餐饮、旅行、休闲娱乐等各个场景数据，为美团各场景业务提供更加智能的服务；在知识图谱、个性化推荐、用户画像、时空数据挖掘等领域展开了众多的创新性研究，并在相关领域的顶级会议和期刊上发表30余篇论文，如 KDD, WWW, AAAI, IJCAI, TKDE, TIST 等，曾获 ICDM 2013 最佳论文大奖，出版学术专著1部。"
		},
		{
			"title": "人工智能在互联网游戏平台中的应用",
			"yanjiang": "主要介绍人工智能、机器学习、数据挖掘等数据技术在互联网游戏平台中的应用，重点讲如何建立 AI 体系并结合业务体系赋能平台，包括拉新、导量、促活、创收等各个环节，也包括在平台风控体系、反作弊等领域的应用。会结合案例分享下 AI 体系赋能互联网平台的实践经验，在业务建模、策略选择、方案设计、算法调优等方面与听众进行交流。",
			"post": "巴川 竞技世界 首席数据科学家",
			"jiabin": "资深数据科学家，曾就职于中国搜索、搜狐畅游等互联网公司，主要从事互联网数据挖掘工作，现任竞技世界（北京）网络技术有限公司首席数据科学家；主要研究领域包括互联网用户行为挖掘、运营分析、产品分析、社交网络挖掘、反作弊、风控体系、推荐系统、数据可视化等；北航兼职硕导，西安交大研究生院授课专家，华南理工大学、武汉大学、南京大学、贵州大学、对外经贸大学等多所高校兼职教师；中国教育创新校企联盟首席数据科学家、专家委员会副主任，互联网+大学生创新创业大赛专家评委，厦门大学、南京大学等多所高校创新创业导师；TOP100 全球软件案例研究峰会、A2M 人工智能与机器学习创新峰会、中国数据分析师行业峰会、中国软件技术大会、TID 质量竞争力大会、全球互联网经济大会等会议演讲嘉宾。"
		},
		{
			"title": "数据和 AI 驱动用户增长",
			"yanjiang": "用户增长（User Growth）和增长黑客（Growth Hacking）是近些年非常热的一个主题，用户增长非常强调以数据和技术为驱动，组建紧凑、多角色的增长团队去做快速极致的小步迭代，从而提升用户的新增、留存和活跃。用户增长是一种全新的组织方式和推进方式，打破了传统市场、传播、产品、运营和技术的界限。他另一个强调的特点是对用户社交和分享的重视，让现有用户来不断带来新的用户。当用户增长和人工智能碰到一起，能够碰撞出怎样的绚烂火花？人工智能，深度学习，个性化推荐等技术是如何帮助一家互联网企业实现用户的增长和产品提升的？本次演讲会做一些粗浅的探讨。",
			"post": "张翼 前快手 增长技术负责人",
			"jiabin": "硕士毕业于浙江大学-微软联合视觉感知实验室，在百度工作6年，参与百度第一代大规模机器学习模型的研发；后在多家公司从事大数据和算法相关研究，热爱用技术和数据驱动业务成长；曾任快手增长技术负责人；曾发表论文两篇，专利10余项。"
		},
		{
			"title": "腾讯营销数据平台",
			"yanjiang": "广告平台是一个数据驱动的平台，数据在系统中高效流动，形成闭环，产生价值。腾讯广告系统每天有上百亿次请求量，以及上百T的数据，保证数据流的稳定可靠和高性能是数据系统的核心问题。对于数据分析场景，我们基于 Spark 和 Hbase 构建了一套实时离线统一的统计系统，同时也自研了一套基于 ssd 的多维数据透视分析系统，对万亿行数据做实时查询仅需秒级; 对于机器学习，特征工程重点是保障特征数据的正确性，保证训练和预估使用的特征数据一致性，并且提升特征生产和调研的效率。此外，腾讯积累了大量的数据，同时非常注重用户隐私，不会把底层数据任意打通任意使用，为了保护用户数据安全，我们在 Hadoop 的鉴权机制之上构建了更加安全和严格的鉴权系统，并通过差分隐私，数据脱敏和水印等方式保护各场景下的数据安全，同时也基于密码学多方安全计算提供了部分场景下更加安全的数据应用方案。我们基于 Hadoop 构建了高性能高可靠性的营销数据平台，在保证数据安全前提下，提供在线分析处理和特征建模能力，支持腾讯的广告营销和智慧零售等业务高速发展。",
			"post": "李锐 腾讯 广告数据系统总监",
			"jiabin": "腾讯广告数据系统负责人，2011年加入腾讯，专注大数据存储和计算系统，有9年分布式系统开发和应用经验，带领腾讯广告的数据工程团队，打造基于 Hadoop 生态的营销数据平台，支持腾讯的广告营销和智慧零售业务。"
		},
		{
			"title": "基于 Redis Cluster 的灾备与同城双活实践",
			"yanjiang": "Redis Cluster 在 vivo 有广泛的应用，Redis Cluster 在解决了扩展性和可用性问题后，也引入了新的问题，比如如何跨机房容灾、如何跨机房高可用，针对这些问题，我们在 Redis Cluster 上做了一些灾备与同城双活的探索与实践。",
			"post": "肖博 vivo 互联网 高级数据库架构师",
			"jiabin": "vivo 数据库架构师，负责 vivo 数据库高可用架构改进与数据库平台建设。曾就职于百度数据库团队，负责 MySQL 运维研发和 Redis 平台建设。"
		},
		{
			"title": "多模 NoSQL 架构的实践与演进",
            "yanjiang": "本次演讲重点介绍华为云 Gemini 数据库在架构上的实践创新，包括存储与计算分离设计理念，多模 NoSQL 的统一架构，秒级弹性、秒级备份恢复等关键能力。",
            "post": "胡达 华为云 NoSQL 资深架构师",
            "jiabin": "2004年加入华为公司，负责电信系统用户数据管理设备中的 NoSQL 数据库架构设计与开发，对数据库的分布式、一致性、高可用、弹性等关键技术方案拥有丰富的实践经验，熟悉 MongoDB、Cassandra、Redis 等数据库产品；现任华为云 NoSQL 数据库架构师，负责 Gemini NoSQL 服务的架构设计与开发。"
		},
		{
			"title": "阿里云 TSDB：拥抱物联网的新一代时序时空数据库",
			"yanjiang": "阿里云 TSDB 是阿里自研的一种高性能，低成本，稳定可靠的在线时序时空数据库产品。该产品统一了阿里巴巴集团90%以上的 APM 数据和事件型数据的存储和计算，并在广泛应用于外部的物联网，工业制造，电力，化工以及IT运维等行业。本演讲将介绍该时序时空数据库的种种黑科技：<br>・提供千万级并发读写；<br>・双十一写入 TPS 达到6000万/秒；<br>・十倍以上压缩比低成本存储；<br>・PB级时序时空数据秒级聚合；<br>・每天百亿时间线的集群规模等等。",
			"post": "老滚（伊翼） 阿里云智能数据库事业部技术专家",
			"jiabin": "目前在阿里云智能数据库事业部担任技术专家，从事 TSDB 核心引擎的研发工作。"
		},
		{
			"title": "网易游戏 MongoDB 集群在线升级迁移实践",
			"yanjiang": "MongoDB 数据库在网易游戏内部应用比较广泛，由于 MongoDB 本身更新迭代周期比较快，同时在游戏业务应用中，游戏引擎层面的迭代、负载的急速变更以及不停服维护、历史遗留等多方面的需求，对集群线上数据进行版本升级或资源调整迁移变得越来越频繁。本分享主要介绍网易游戏在不停服情况下基于 MongoDB 数据库所进行的在线升级迁移实践。",
			"post": "郑良榉 网易游戏 数据库工程师",
			"jiabin": "目前任职网易游戏 Ocean 数据库产品组，主要负责网易游戏内部 MongoDB 数据库相关业务，包括服务规范化、运维自动化、应用性能优化以及功能开发等方面，曾参与 2017 DTCC 数据库会议、MongoDB 广州社区分享等。"
		},
		{
			"title": "大容量 Redis 存储服务在微博的演化和实践",
			"yanjiang": "微博 Redis 系列服务及典型应用场景，微博大容量 Redis 存储服务的架构演进，微博自研 Redis 混合存储服务 redrocks 的设计思路及应用实践，以及微博 Redis 在服务化方面的实践及后续规划。",
			"post": "刘东辉 新浪微博 高级系统研发工程师",
			"jiabin": "新浪微博基础架构组高级系统研发工程师，主要负责微博分布式缓存与存储方向，先后参与了微博 Redis、CounterService、CacheService、RedRocks 等基础服务的设计与开发工作。"
		},
		{
			"title": "中国农业银行数据库使用实践和发展规划",
			"yanjiang": "中国农业银行在信息化系统建设过程中，先是把关系型数据库作为联机交易型数据库使用，后来为满足分析型应用需要开始使用分析型数据库，近几年来随着应用场景细分，对基于 Hadoop 的大数据生态和新兴起来的 NoSQL、NewSQL 等数据库也逐步开始了大量应用。在数据库的整个使用过程中，关系型数据库一直占据着最为重要的位置，市场上主流关系型数据库产品都有使用到，也积累了较多的使用经验。随着这几年两地三中心工程建设，对关系型数据库的使用提升到了一个新的层次。为了适应业务和技术市场的不断进化，对分布式数据库、Spark SQL 等新兴数据库技术也有了深入的探索研究和实践，对数据架构管控、数据生命周期管理和数据库产品应用进行了整体规划。",
			"post": "蔡仕志 农业银行 研发中心高级专家",
			"jiabin": "理学学士，高级工程师，先后就职于中国农业银行福建省分行、总行软件开发中心、信息技术管理部、数据中心，现任中国农业银行研发中心高级专家；长期深耕系统技术领域，曾获国家机关优秀青年创新奖，工作成果先后获得人民银行、银监会各类奖项10余次。"
		},
		{
			"title": "分布式数据库助力金融科技架构转型",
			"yanjiang": "随着金融业务的移动互联网和智能化发展，金融科技也在面临分布式架构转型。本次分享，将通过分布式数据库在数十家大型金融企业中的实践，探讨金融科技分布式架构转型的最佳实践。",
			"post": "王涛 联合创始人&CTO",
			"jiabin": "SequoiaDB 巨杉数据库的联合创始人，CTO 与总架师；曾是北美 IBM DB2 Lab 核心研发成员，负责 DB2 核心引擎研发，还曾参与世界第一款分布式数据库 DPF 的研发；有着超过十五年的数据库核心架构设计、研发和创新经验；作为巨杉数据库的总架构师和技术产品负责人，自2011年以来，在王涛的领导下，SequoiaDB 的技术团队从零开始打造的分布式数据库。<br>如今 SequoiaDB 目前已经拥有超过50家大型银行用户，以及超过一千家企业用户。SequoiaDB 于2017、2018年连续入选国际技术分析机构 Gartner 的数据库年度报告，是中国首家入选的数据库厂商。"
		},
		{
			"title": "分布式数据库高可用最佳实践",
			"yanjiang": "分布式数据库在保证一致性的前提下，如何设计和验证高可用能力。本次将分享软件和硬件等故障异常，包括运营操作异常、突发交易异常、系统进程异常、网络异常、操作系统异常、服务器硬件异常和切换异常。通过架构冗余支持，使得分布式数据库能够满足业务连续性和数据一致性要求。",
			"post": "王飞鹏 中信银行 数据库专家",
			"jiabin": "数据库专家，拥有多年IBM原厂数据库引擎开发和银行数据库运用经验，擅长数据库开发、维护和性能优化，通过数据库专著全面总结了长期的理论探索与实践经验。"
		},
		{
			"title": "分布式闪存数据库与图数据库的金融行业应用实践",
			"yanjiang": "让业务更灵活、快速地使用数据、发掘数据价值以及提升数据的业务解释性成为金融行业对数据库产品的应用诉求；基于新型的分布式计算框架，星环自主研发的分布式闪存数据库帮助业务人员在海量数据下实现自助分析与探索；星环的分布式图数据库广泛运用于营销、风控、反洗钱等领域，通过图关系发现数据价值、提升业务解释性。本次演讲将讲述星环分布式闪存数据库和图数据库的技术特点以及在金融行业中的应用实践。",
			"post": "庞博 星环科技 资深架构师",
			"jiabin": "毕业于香港科技大学计算机系，曾就职于 Oracle 研究开发中心，负责 RAC、ASM 等数据库底层分布式技术的研究与开发工作。目前在星环负责大数据基础架构和解决方案的设计与规划工作，曾帮助多家大型金融机构构建大数据与人工智能体系建设。"
		},
		{
			"title": "工行开放平台 OLTP 数据库转型实践",
			"yanjiang": "本次主题分享将介绍工行 IT 架构转型中传统 OLTP 数据库架构面临的挑战和诉求，构建基于 MySQL 分布式企业级解决方案实践历程，包括技术选择、高可用设计、两地三中心容灾、运维管理、资源使用效率等方面的思考和实践经验，同时也介绍了工行转型的成效以及对后续工作的一些思考。",
			"post": "林承军 中国工商银行软件开发中心 高级经理",
			"jiabin": "中国工商银行软件开发中心高级经理，多年来一直从事开放平台相关技术研究及实施工作，多次参与工行重点项目的原型技术研究、IT 架构转型及优化提升，在分布式、高可用架构、数据高效访问领域有丰富的实施经验。近年来，牵头 MySQL/分布式数据库团队工作，借鉴和引入业界成功经验，通过自主研发 技术引入，迅速形成基于开源 MySQL 的企业级应用研发能力，初步建立了企业级解决方案，推动工行开放平台 OLTP 数据库转型的实施。"
		},
		{
			"title": "网易考拉基于 MGR 的跨机房实践",
			"yanjiang": "MySQL 官方在5.7.17正式发布了 MySQL Group Replication 功能，提供了基于 Paxos 协议实现的多副本数据同步和故障选举，网易在第一时间对 MGR 进行了全面的测试和深入的研究，并基于 MGR 构建了跨机房多副本数据库集群，应用于网易考拉电商业务。本次分享将为大家介绍如何基于 MGR 构建跨机房多副本数据库集群，以及网易在 MGR 的使用过程中遇到的陷阱和对 MGR 的功能增强。<br>1. 深入 MySQL Group Replication；<br>2. 基于 MGR 的跨机房集群架构设计；<br>3. 基于 MGR Muti-Priamry 的集群水平扩展方案；<br>4. 网易在使用 MGR 过程中遇到的坑。",
			"post": "郭忆 网易 数据库专家，网易云数据库负责人",
			"jiabin": "网易云数据库负责人，网易数据库平台开发专家，研发了网易云数据库服务，支撑了网易内部包括网易考拉、网易云音乐、云课堂、有道笔记、网易新闻在内的大型互联网业务，8年的数据库开发和管理经验，对云端数据库的架构设计和性能调优有丰富的经验。"
		},
		{
			"title": "多云时代的数据库 PaaS 平台建设实践",
			"yanjiang": "通过分享大型企业，尤其是金融行业内的多云环境下数据库 PaaS 云平台的建设实践经验，看看如何通过数据库云平台向下适配各种云计算环境，向上支持各种类型数据库，来提供整体的数据库云服务和智能运维管理体系。",
			"post": "杨小华 新数科技 CTO 和联合创始人",
			"jiabin": "新数科技 CTO 和联合创始人，其负责研发的专业数据库云管理产品目前广泛应用于国内金融行业和其它大中型企业。加入新数科技之前，曾在 IBM 中国实验室负责 DB2 数据库的产品研发和支持工作。"
		},
		{
			"title": "华为云云上数据迁移的应对之道",
			"yanjiang": "本次主题分享将分析数据迁移的技术从云下到云上的变迁，针对数据上云的核心诉求数据迁移，数据同步，数据灾备等场景的核心难题，阐述华为云数据库的应对思路。",
			"post": "胡彦军 华为云 数据库高级产品经理",
			"jiabin": "12年数据库从业经验，对迁移、灾备、OLTP & OLAP 性能优化有着丰富的经验，擅长 Oracle、SQLServer、MPP 型数据库，熟悉 MySQL、MongoDB 等开源数据库，曾就职于 IBM、Merkle 等知名数据公司，担任高级 DBA，项目 Leader 等职务。"
		},
		{
			"title": "京东弹性数据库探索实践",
			"yanjiang": "京东弹性数据库不是一个单一的产品，而是京东在对数据库的使用、运维和开发过程中遇到的一系列问题的解决方案和运维经验的总结升华进而形成的一套产品系列。本次主要讲解京东弹性数据库在 CloudNative 之路上做的一些工作和经验总结。",
			"post": "郭伟 京东 高级研发工程师",
			"jiabin": "曾职于搜狐畅游，高阳等公司，负责京东弹性数据库的架构及研发工作，之前曾在高阳捷讯负责联通一卡充系统的研发和架构工作，之后加入搜狐畅游端游研发中心负责大型 MMORPG 的研发工作；之后加入京东负责京东大规模分布式数据库中间件的研发与架构工作，为京东众多业务产品线提供高可靠的数据库存储服务。"
		},
		{
			"title": "如何构建云时代 DBA 知识体系",
			"yanjiang": "进入云时代以后，IT 行业各工种的职责都在发生变化，云数据库使日常 DBA 管理实现更多自动化，不仅大大提高了日常管理效率，同时也使得企业整体投资产出更快获得成效。不少企业从业务开始之初就直接使用云计算，因此，对于 DBA 而言，当前是一个转变期。通过本次分享，希望协助行业中即将转型的 DBA 及新进入 DBA 行业的技术人员，加深对云 DBA 的了解，让大家在转型过程少走弯路。<br>1. 云数据库 vs 传统数据库管理模式对比；<br>2. 云 DBA 知识体系构成：基础、云主机、云数据库、智能化管理；<br>3. 直接使用云数据库与在云主机中自建数据库的管理差异；<br>4. 如何成长为一名优秀的云 DBA。",
			"post": "铁庵（萧少聪） 阿里云智能数据库事业部高级产品专家，PostgreSQL 中国社区常委",
			"jiabin": "阿里云智能数据库事业部高级产品专家。主要负责 RDS 产品的发展规划及产品演进。2011年获得 Postgres Plus Professional 认证，同年以理事身份筹建 PostgreSQL 中国用户会。"
		},
		{
			"title": "Oracle Database - 持续的数据库技术创新者",
			"yanjiang": "作为全球数据库的领导者，Oracle 始终秉承以客户需求为中心、坚持创新，Oracle 最新的 Database 19c 及自治数据库云服务，持续关注企业数据总量在每年呈指数级增长的情况下的数据库管理效率、多数据中心架构连续可用及数据安全问题，引入机器学习及人工智能技术等，为企业提供高安全、低成本和高效全自治的数据库架构，让企业通过创新提升业务收益。",
			"post": "李珈（Joyce Lee） 甲骨文 中国公司云平台事业部高级技术总监",
			"jiabin": "超过二十年 Oracle 数据库、数据仓库及企业应用软件领域相关工作经验，丰富的电信、金融及政府和制造业行业经验，曾主持设计电信及金融行业大型关键业务系统及大型数据仓库系统，对关系型数据库系统、ERP、CRM 系统及大数据应用有深刻理解, 致力于企业信息化战略及 IT 架构设计与咨询领域，对于企业云平台设计包括私有云和公有云以及混合云的设计和推广有较多经验。目前负责甲骨文中国区云平台技术咨询团队工作包括数据库及中间件、大数据及 Oracle 云平台产品(PaaS/IaaS)。"
		}
	],
	"list2": [{
			"title": "开源数据库在平安的应用实践",
			"yanjiang": "平安作为综合金融企业，坚持“科技引领金融”的发展理念，运用现代科技的巨大力量，引领了金融行业的科技转型。众所周知，在金融行业，由于数据的敏感性、安全性及行业监管的高要求，大家对开源数据库基本保持观望态度，或只在一些非核心系统中使用。开源数据库真的离金融企业很遥远吗？如何使用开源数据库实现金融行业级别的高可用？平安科技在近几年引入了多种类型的开源数据库，支持了众多专业子公司的复杂应用场景，在集团内外部得到了很好的应用实践。在这个主题中，将介绍平安引入开源数据库的方式方法以及各种开源数据库如何在平安应用实践，包括 PostgreSQL、MongoDB、MySQL、Redis、TiDB、InfuxDB、Neo4j 等，以及如何打好开源数据库这套“组合拳”，全方位覆盖和支持金融企业业务场景。",
			"post": "汪洋 平安科技 数据库产品及存储产品部总经理",
			"jiabin": "从事数据库领域相关开发运维工作20多年，近年来开始关注和研究新型及开源存储、数据库产品在金融行业的应用，配合公司整体战略，促进传统金融向互联网的快速转型。"
		},
		{
			"title": "超大规模实时数仓架构挑战与实践解析",
			"yanjiang": "数据分析领域目前正在朝着在线化方向演进，数据业务在海量数据实时写入、高并发分析、稳定性、灵活性上挑战巨大。分析型数据库 AnalyticDB 是阿里巴巴自主研发的超大规模 PB 级实时数据仓库，近2年在上述挑战背后的技术领域稳扎稳打，做了大量的难点突破和技术创新，本次演讲深入分析 AnalyticDB 海量数据毫秒级分析背后的架构挑战以及工程实践。",
			"post": "意博（林亮） 阿里云智能数据库事业部研究员",
			"jiabin": "阿里巴巴数据库产品事业部研究员，曾就职 Google 十多年，在超大规模 SQL Engine 和规模存储引擎上经验丰富。目前在负责阿里云 PB 级分析型数据库 AnalyticDB 架构工作。"
		},
		{
			"title": "超融合 inData 数据库一体机应用实践",
			"yanjiang": "浪潮2019年推出 inData 一体机，该款产品主要解决极致的 OLTP+OLAP 混合场景和易用管理的市场需求，分享这款产品的应用实践，基于应用场景介绍一些技术、性能等相关亮点及实践经验。",
			"post": "钱进 浪潮 高级产品架构师",
			"jiabin": "从事基础软件产品工作8年，主要涉及基础中间件、应用集成、数据库、数据挖掘、数据交换等。目前主要负责浪潮基础软件产品架构和前沿大数据技术领域研究。"
		},
		{
			"title": "大规模电商服务的数据库架构演进",
			"yanjiang": "介绍电商业务背后的数据库架构演进历程，从单体商业数据库到开源 MySQL 到容器化、集群化、多元化，以内存为中心，跨地域复制，并介绍支持计算与存储分离的储宝文件系统。",
			"post": "刘海锋 京东商城 技术副总裁",
			"jiabin": "京东零售首席架构师、技术副总裁，负责容器平台、存储与数据库、中间件等基础设施建设。"
		},
		{
			"title": "云时代的数据库 - Oracle 的技术演进之路和19c新特性揭秘",
			"yanjiang": "在云时代，数据库技术也正在经历翻天覆地的变革，商业数据库时代独领风骚的 Oracle 数据库，在新时代将向何处去？在这个主题中，我将为大家梳理 Oracle 公司的技术变革历程，分析其未来的产品演进方向，以及 Oracle 面向云时代的自治数据库、机器学习等功能增强。在2019年，Oracle 数据库的最新版本 19c 将会发布，在这个主题中，同时将对 Oracle 19c 最新特性展开探讨：Oracle 的智能索引技术将通过机器学习自动分析和创建最佳索引，解决困扰开发者和用户的性能问题；主从库之间的透明事务重定向，将读写分离和性能隔离更进一步，为企业数据架构提供更加灵活的解决方案；在优化器方面，自动的 SQL 执行计划管理将能够更好的区分 SQL 的执行计划优劣，自主做出选择并确保性能改善；19c 还提供了大量的 SQL 开发新特性，让研发更有效率。",
			"post": "盖国强 云和恩墨创始人 Oracle ACE 总监",
			"jiabin": "拥有超过15年的数据库实施和顾问咨询经验，对于数据库性能优化及内部技术具有深入理解；著有《深入解析 Oracle》、《循序渐进 Oracle》等技术书籍。"
		},
		{
			"title": "海量数据，超大并发，数据库无损扩容四种实践",
			"yanjiang": "海量数据，超大并发下，水平切分是常见的提升数据库存储容量的架构实践。但随着数据量的持续增加，如何对水平切分的数据库进行再次扩容，如何在扩容的过程提供无损服务，如何进行平滑数据迁移，是大家经常面临的问题。本次分享，将分享四类常见实践，以解决上述问题。",
			"post": "沈剑 快狗打车（原58速运） CTO",
			"jiabin": "互联网架构技术专家，快狗打车 CTO，“架构师之路”公众号作者；曾任百度高级工程师，58同城技术委员会主席，58到家技术委员会主席；现任快狗打车 CTO，负责快狗打车技术体系的搭建；本质，技术人一枚。"
		},
		{
			"title": "CynosDB for PostgreSQL 一主多读架构",
			"yanjiang": "PostgreSQL 数据库通过数据冗余和日志同步实现一主多读，并允许备机在主机不可用后，替换主机继续对外提供服务，保证系统的可用性。在 CynosDB 的计算-存储分离架构里，数据库实例共享同一份数据，而且一主多读的设计与传统数据库相比也有很大差异。在本次议题中，将会与大家分享 CynosDB for PostgreSQL 的一主多读的设计和优化。",
			"post": "孙旭 腾讯云 高级工程师",
			"jiabin": "腾讯云高级工程师，9年数据库内核开发经验；熟悉数据库查询处理，并发控制，日志以及存储系统；熟悉 PostgreSQL（Greenplum，PGXC 等）、Teradata 等数据库内核实现机制。"
		},
		{
			"title": "基于 Flink 的异构海量数据源传输系统",
			"yanjiang": "异构数据源之间的相互传输同步是公司大数据平台里常见的问题，当数据源类型繁多并且数据量巨大时便会成为比较大的挑战。本次演讲主要分享字节跳动基于 Flink 的异构海量数据源传输解决方案，实现对多种数据源间高性能并发的稳定传输，以及对 Flink Batch 框架的优化。",
			"post": "罗齐 字节跳动 高级大数据平台工程师",
			"jiabin": "现任字节跳动高级大数据平台工程师，曾任职于亚马逊全球供应链部门负责数据平台开发。擅长大规模数据处理和传输平台的搭建，对大数据处理和存储技术有深入研究。"
		},
		{
			"title": "滴滴离线大数据实践之路",
			"yanjiang": "面对海量数据的日益增长，存储和计算都会遇到一些瓶颈，例如 NameNode 单点问题，数据存储的治理问题等等。在滴滴的离线场景中，存储使用 HDFS，计算使用 MR、HIVE、SPARK，本次分享将介绍滴滴离线大数据从存储到计算的架构，针对这些问题滴滴是如何思考和解决的。",
			"post": "费辉 滴滴出行 大数据架构技术专家",
			"jiabin": "滴滴出行大数据架构技术专家，负责离线存储；在加入滴滴之前，曾在阿里巴巴参与过 JVM 和 EMR 产品的开发；开源大数据爱好者，积极参与社区的交流讨论。"
		},
		{
			"title": "美团万亿级数据采集系统架构实践",
			"yanjiang": "美团作为中国领先的生活服务电子电商平台，具有业务场景丰富、业务复杂度高、数据规模大等特点，对数据采集提出了非常高的要求。演讲主要介绍美团数据采集系统的架构演进，包括公司级统一的日志规范和日志组件，多机房多地域带来的架构挑战，全链路数据质量监控，通道的隔离机制，海量数据消费需求的支撑等。",
			"post": "杨永辉 美团 高级技术专家",
			"jiabin": "美团高级技术专家，硕士毕业于中科院自动化所，曾就职于阿里巴巴。现在美团基础数据部，负责美团数据收集通道建设，旨在为公司提供高效、可靠、易用的数据收集、分发服务。"
		},
		{
			"title": "企业数字转型之数据库实践",
			"yanjiang": "在企业数字化转型的浪潮中，企业不断的摸索自身的数字化转型，在这过程中往往会面临很多新的挑战。首当其冲的就是数据库，随着企业业务量的高速增长，面向千万订单，如何解决海量数据查询等实践问题。而数据库如何设计，数据库架构如何分库分表，如何实践出符合自身业务的数据应用方案？这些种种问题，都是传统企业在转型过程中遇到的问题。这给企业带来的不仅仅是技术上的挑战，也有人员能力模型的挑战。云徙科技致力于传统企业的数字化转型，在与企业共创数字化场景的过程，也摸索了一些相关的实战经验。在这个议题里，我们将介绍传统企业数字化转型过程中的数据应用实战。",
			"post": "郭逸重 云徙科技 产品开发总监",
			"jiabin": "多年的研发经验，对高并发、高性能拥有实战经验；在云徙科技有限公司负责公司业务中台产品的研发建设，带领研发团队开发业务中台产品；期间进行主要的技术路线选型，基础开发框架的搭建，进行相关中台系统的架构设计及核心开发。"
		},
		{
			"title": "网文推荐系统的演进之路",
			"yanjiang": "随着移动互联网的兴起，人们获取信息越来越方便，但是海量的信息，狭小的手机屏，给人们带来信息过载的困扰。推荐系统作为一种过滤系统，能够帮助用户在海量的信息中快速找到自己需要的内容。本次分享将从推荐系统进行拆分，并且针对于推荐系统历史变迁做一些回顾，帮助大家更好的理解推荐系统，同时从阅文实际业务出发，分享一些实践经验。",
			"post": "陈炜于 阅文集团 智能业务中心总监",
			"jiabin": "阅文集团智能业务中心总监，负责阅文集团的智能技术建设，包括推荐，搜索，用户画像，文本挖掘，内容风控等数据智能方向；之前在百度大数据部工作8年，一直和数据打交道，曾负责精准广告系统，用户画像系统，百度推荐，用户线下大数据，新零售等项目的研发和管理工作。"
		},
		{
			"title": "专注 AI 生态 科技赋能招聘",
			"yanjiang": "人工智能被称为第四次产业革命，21世纪中期，人工智能已经进入生态竞争阶段。技术赋能产业带来的变革涉及方方面面，2012～2016年，中国人工智能创业企业呈爆发式增长，2018年国内人工智能创业企业近2000家，企业对 AI 人才求贤若渴，但 AI 领域的人才极度稀缺，企业在人才获取上都困难重重，更不提选、育、留的问题。人工智能时代下，高端 AI 人才必定是在全球范围内跨区域流动，从而找到符合自身价值诉求的最优工作岗位，但由于信息不对称和逆向选择的问题，人才的求职满意度往往偏低，导致人才流动频繁、企业错配率高。如何利用人工智能技术从招聘和求职出发，实现人才、项目和资金三者的最优配置，成为每个企业亟待解决的问题。",
			"post": "廖向东 灏博大数据 CEO",
			"jiabin": "北京邮电大学 MBA；拥有大数据和人工智能行业超过10年的行业经验；长期从事机器学习、深度学习、认知智能等人工智能技术的商业化运用项目，逐渐形成强大的市场拓展能力和项目运营能力。"
		},
		{
			"title": "Spark Shuffle 稳定性与性能优化",
			"yanjiang": "随着集群规模的不断增涨以及集群负载的不断上升，大型任务由于同时使用的节点数量大，碰到高负荷甚至满负荷节点以及故障节点的可能性也随之增加。对于大型 Spark 作业，在 Shuffle Read 阶段碰到满负荷节点或故障节点会出现 Shuffle 失败从而引起 Stage 重试进而造成作业执行时间增长甚至执行失败最后影响 SLA。因此提升 Shuffle 稳定性对保障 SLA 及提升资源利用效率具有重要意义。本次分享将介绍字节跳动提升 Spark Shuffle 稳定性的实践以及提升 Spark Shuffle 性能的探索。",
			"post": "郭俊 字节跳动 大数据工程师",
			"jiabin": "目前就职于字节跳动，主要负责以 Hadoop、Spark 为代表的大数据系统在万级节点下的优化。曾就职于 Cisco、eBay 等公司。"
		},
		{
			"title": "AI 技术如何打造58同城智能客服机器人",
			"yanjiang": "智能客服重塑了传统客服流程，提高了客服人效和用户体验。58同城帮帮智能客服对话机器人支持 QABot、TaskBot 和 ChatBot 三大核心功能，本次分享将介绍相关的对话算法和系统架构，阐述如何利用AI技术提高五八同城客服人效。",
			"post": "詹坤林 58同城 AI Lab 负责人",
			"jiabin": "58同城 AI Lab 负责人，算法高级架构师。负责推动AI技术在58生活服务行业的落地，为58集团打造全面AI能力；目前负责主要产品包括智能客服机器人、语音机器人、智能写稿机器人、智能推荐系统、人工智能平台等；硕士毕业于中国科学院大学，研究方向为数据挖掘，曾任腾讯高级工程师，负责微博/新闻推荐算法研发。"
		},
		{
			"title": "人工智能在数字营销领域的实践",
			"yanjiang": "将主要分享在人工智能时代，精硕科技在数字营销领域的一些实践，包括平台构建、算法落地和具体的案例等，包含但不限于实时智能广告推荐、自动应答客服、跨设备用户识别等等。",
			"post": "刘喆 明略科技 高级架构师",
			"jiabin": "明略科技集团数据治理团队负责人，2013 年至今, 主要负责数据处理的全流程技术支持，高性能和高可用的分布式架构设计，DSL 语言抽象，Hadoop/HBase/Storm/Spark 等大数据>平台优化。2010年硕士毕业后在百度就职，负责当时全球规模最大的 Hadoop 平台的运维开发工作；2011年底加入人民搜索，代理运维总监；在多年的大学生活和工作经历中，一直在追求简单直接，关注于数据挖掘/大数据/DSL/系统架构，对分布式计算/分布式架构和程序语言情有独钟，曾多次被 51CTO/spark 峰会/into100 峰会等邀请为嘉宾分享 Hadoop/spark/开源软件等相关经验。"
		},
		{
			"title": "Apache ShardingSphere（incubator）之起承转合",
			"yanjiang": "ShardingSphere 于2018年11月10日正式进入 Apache 基金会的孵化器，成为首个 Apache 的分布式数据库中间件。本次分享将介绍 Apache ShardingSphere 的发展现状、内核实现和线路规划。希望能为听众在技术选型时提供有效参考，或者为自研中间件的团队提供思路。",
			"post": "张亮 京东数科 数据研发负责人",
			"jiabin": "热爱开源，目前主导两个开源项目 Elastic-Job 和 ShardingSphere(原名 Sharding-JDBC)；擅长以 Java 为主分布式架构以及以 Kubernetes 和 Mesos 为主的云平台方向，推崇优雅代码，对如何写出具有展现力的代码有较多研究；2018年初加入京东数科，目前主要精力投入在将 ShardingSphere 打造为业界一流的金融级数据解决方案之上；ShardingSphere 已经进入 Apache 孵化器，是京东集团首个进入 Apache 基金会的开源项目，也是 Apache 基金会首个分布式数据库中间件；预定于2019年初出版书籍《未来架构 — 从服务化到云原生》。"
		},
		{
			"title": "CockroachDB 2.x 新特性详解",
			"yanjiang": "CockroachDB 作为业界领先的开源 NewSQL 数据库解决方案之一，从2014年正式开源到2019年已经演进到了2.2版本。在 2.x 系列新引入了多个重要的特性，旨在为用户提供一个更可靠、更高性能、更易用的分布式数据库系统。在这个主题中将分享 CockroachDB 的基于代价估算优化器、Read From follower、CDC 等新特性的详细实现和原理。",
			"post": "严龙 百度 数据库团队 NewSQL 数据库架构师",
			"jiabin": "百度数据库团队 NewSQL 数据库架构师，CockroachDB PMC Member。"
		},
		{
			"title": "TiDB 的 HTAP 之路 - 过去，现在和将来",
			"yanjiang": "TiDB 从一开始就在向 HTAP 数据库的方向不断前进着，期望能弥合交易和分析两者设计中的鸿沟，从一开始的协处理器架构，到 TiSpark 插件再到今天的行列混合架构，TiDB 正在不断补完 HTAP 方向的各个短板。本次演讲将和大家探讨 HTAP 的价值以及困境，TiDB 在 HTAP 方向的架构演进历程，以及我们对将来的设计思考。",
			"post": "马晓宇 PingCAP 分析型产品负责人",
			"jiabin": "PingCAP 分析型产品负责人。曾就职于 Quantcast、网易，负责构建和管理大数据平台；关注分布式系统，SQL 引擎开发等领域。"
		},
		{
			"title": "Fusion：从 NoSQL 到 NewSQL 的演进实战",
			"yanjiang": "Fusion 是滴滴自研的分布式 NewSQL 数据库，诞生初期主要支持 Redis 协议（NoSQL），然后在不断解决业务问题的过程中逐步兼容 MySQL 协议，并支持超大规模的数据持久化和高性能读写。在滴滴内部支撑了数百个业务，具有数 PB 的数据存储量以及数千万的 QPS，是内部使用最广泛的主存储服务之一。本次的演讲将重点介绍 Fusion 如何从 NoSQL 演进到 NewSQL，演进过程要解决哪些问题（索引、Schema、SQL 解析等），以及为什么要向 SQL 演进。",
			"post": "余汶龙 滴滴出行 技术专家",
			"jiabin": "曾就职于 VMware、淘宝核心系统、阿里云数据库组，长期从事分布式存储相关的研发；对分布式系统、数据一致性、高可用系统、高性能服务器、存储引擎等方向有深入研究；2016年加入滴滴，从零开始构建滴滴自研的分布式 NewSQL 数据库 Fusion。"
		},
		{
			"title": "腾讯 HTAP 数据库 TBase 在腾讯核心业务中的使用",
			"yanjiang": "TBase 是腾讯自研的分布式 HTAP 数据库，具备完整的分布式事务处理能力，支持分布式一致性读，完整支持 SQL2003，并支持各种高级 SQL 语法功能，在腾讯内部有大量的业务运行在 TBase 上面。这里主要分享 TBase 的核心技术原理和腾讯内部业务场景中的使用，演讲主要包括以下几个部分：<br> 1. TBase 的核心架构和原理；<br> 2. TBase 在微信支付中的应用；<br> 3. TBase 腾讯地图中的应用；<br> 4. TBase 在 qqmail 中的应用；<br> 5. TBase 其他。",
			"post": "许中清 腾讯云 数据库专家工程师 ",
			"jiabin": "腾讯云自研云原生数据库 CynosDB 的分布式存储 CynosStore 负责人，负责数据库内核开发、数据库产品架构、规划和落地。2015年加入腾讯后参与过分布式数据库 TBase 的开发以及在微信支付的落地和运维、CynosDB 等数据库产品研发。专注于关系数据库、分布式系统、新型数据库架构、以及新硬件的应用等领域"
		},
		{
			"title": "银联自研分布式数据库实践",
			"yanjiang": "面向数据库研发同行，介绍银联自主关系型分布式数据库 UPDRDB 的最新情况。UPDRDB 采用基于中间件与分布式存储引擎结合的技术方案，该方案通过较为经济的研发成本，实现了 OLTP 的高性能和完备的 SQL 支持，同时面对 OLAP 问题，采用了与 Spark SQL 适配的方案，进一步丰富了产品的技术应用领域。",
			"post": "周家晶 中国银联 团队主管",
			"jiabin": "专注分布式后台联机系统研发工作，2014年起从事 MySQL 研发工作，负责打造银联自主分布式中间件相关产品，并参与周边产品的研发工作。"
		},
		{
			"title": "兴业数金云数据库架构设计与运维实践",
            "yanjiang": "本次演讲介绍兴业数金云数据库设计、优化、及运维实践，如何利用云数据库为企业创建核心价值，如何在云时代面对海量 MySQL、Oracle、Informix 服务的运维挑战。",
            "post": "林春 兴业数金 首席 DBA",
            "jiabin": "曾任 Oracle WDP OCM 讲师，给花旗总行、上海中行、光大总行、兴业总行提供过高质量的数据库培训，目前在兴业数金负责数据库管理工作；擅长 Oracle、DB2、Informix、MySQL 数据库性能调优、数据库迁移、数据库备份恢复。"
		},
		{
			"title": "分布式事务数据库的破旧立新",
			"yanjiang": "随着人们生活习惯的变化，企业业务纷纷进行数字化转型，随之而来的除了应用的重大变革，数据库也迎来了分布式方向的转变。然而分布式数据库产品千千万，功能品种繁多让用户看花了眼，究竟哪条路线才是正确路线？本次演讲将基于分布式数据库理论，讲述分布式数据库产品的相爱相杀。",
			"post": "黄小慧 热璞科技 高级解决方案工程师",
			"jiabin": "2016年毕业于南京财经大学后进入热璞科技，擅长金融行业、快递行业、交通信息化等数据库解决方案。"
		},
		{
			"title": "如何在初创互联网保险公司快速落地人工智能",
			"yanjiang": "通过描述一个机器学习模型在前置、实时风控系统中的应用实践，交流如何在初创公司快速把机器学习应用到业务流程中。具体包括数据的采集、清洗、模型训练以及工程实现的方案。",
			"post": "徐海鹏 贝壳金服 数据总监",
			"jiabin": "在国内外大型企业及著名互联网公司负责数据部门运营和管理；先后在美国杜邦公司、美国 DoubleClick 和加拿大保险局任职，在 DoubleClick 和加拿大保险局负责数据库与BI部门的运营、数据安全管理以及技术方向选型；2016年，归国加入易到任职数据总监，负责数据部门的规划、执行管理；2017加入量子保科技，一家互联网保险科技公司，任职数据部高级总监，负责数据运营、A.I.应用及大数据风控。"
		},
		{
            "title": "亿级海量数据的实时读写和复杂查询实践",
            "yanjiang": "每日亿级增量数据的实时读写、复杂查询场景实践介绍，涉及 MySQL 分表分库策略、数据异构、TiDB 使用和优化、微服务架构等等。",
            "post": "黄哲铿 中通商业 CTO",
            "jiabin": "前1号店技术总监、海尔农业电商 CTO，2015年出版专著《技术管理之巅》，“技术领导力社区”发起人，擅长大型电商系统研发、供应链系统研发、大型技术团队治理，个人拥有多项技术发明和专利。"
        },
		{
			"title": "TiDB 在平安核心系统的引入及应用",
			"yanjiang": "本次分享将充分比对分析 TiDB 与 CockroachDB 在功能、架构、SQL 特性、备份恢复、压力测试、应用场景测试等方面的表现，也将详解如何选择适用于金融行业级别的开源分布式数据库，以及使用 TiDB 分布式数据库支持金融核心业务系统的应用实践。",
			"post": "何志勇 平安科技 数据库产品团队资深云数据库工程师",
			"jiabin": "拥有超过10年的数据库领域开发运维经验，专注于分布式数据库技术的研究和推广，现负责平安分布式数据库 TiDB 的架构设计、运维与推广工作。"
		},
		{
			"title": "中国银联跨中心&异构数据同步技术与实践",
			"yanjiang": "Moray 是中国银联为支持应用的异地多活、异构数据库的数据同步而设计的组件。本次将分享中国银联实现跨数据中心、高性能、可异构化的实时数据同步技术，以及 Moray 在中国银联异地多活系统中的实践经验。",
			"post": "翁海星 中国银联 数据库研发工程师",
			"jiabin": "中国银联异构 & 异地数据同步项目 Moray 负责人，从事数据库内核研发工作，主要关注存储引擎、数据复制。"
		},
		{
			"title": "VIPKID 的数据库跨云架构设计",
			"yanjiang": "1. RDS 单集群向多集群的演变；</br> 2. 数据库元数据的整理；</br> 3. 使用 MySQL Utilities + VKDS实现自建集群的高可用方案；</br> 4. 实现 MySQL 集群停机升级，修改配置，扩容缩容对业务透明；</br> 5. 基于 VKDS 实现流量分流，权重配比，读写分离，分库分表；</br> 6. 实现多云之间的流量调度；</br> 7. 该方案已承载 VIPKID 300+ 核心功能模块。",
			"post": "郝海民 VIPKID 高级数据库专家",
			"jiabin": "高级数据库专家，2017年加入 VIPKID，在之前的从业经历中，有幸参与多个项目从0到1的优化工作，总结了大量的实战经验。目前主要负责 MySQL，Redis，Mongodb 高性能优化、高可用、规化规范及自动化的建设。"
		},
		{
			"title": "容器化数据库私有云平台建设之路",
			"yanjiang": "容器技术已经趋于成熟稳定，广泛用于公有云或私有云平台部署建设。各大中型企业在互联网应用和数字化转型浪潮中，利用微服务框架的设计思路通过容器化技术打造适合自身业务场景和发展需要的云平台。但容器技术天然打上“无状态”标签，针对使用场景更加严苛的关系型数据库应用，本次将分享如何利用容器和K8s编排技术，打造多类型关系型数据库私有云平台。",
			"post": "麻鹏飞 沃趣科技 产品经理",
			"jiabin": "负责沃趣科技容器数据库方向产品的研发工作，曾任职于网易等大型互联网公司，多年 Oracle MySQL 大规模部署管理和使用经验。"
		},
		{
			"title": "混合介质的多命名空间管理优化 MySQL 数据库性能",
			"yanjiang": "Memblaze 通过拓展 NVMe SSD Multi-namespace 的功能，统一对 DRAM/NVRAM/NAND 等不同的存储介质进行管理，灵活的根据上层应用的特点优化应用 IO 性能和 SSD 寿命。本次大会，Memblaze 将展示混合介质 Multi-namespace 管理功能结合 Percona 数据库 parallel double write file 的应用案例，数据库性能和 SSD 寿命大幅度优化。",
			"post": "朱磊 Memblaze 产品市场总监",
			"jiabin": "2014年加入 Memblaze，在职期间建立 AE 技术支持部，主要负责产品解决方案及应用技术支持；对于数据库、虚拟化、分布式存储系统等场景下的负载模型有多年技术累积，在 NVMe SSD 在存储系统中的实际应用、性能优化以及高级功能设计研发方面有着丰富的实践经验。"
		},
		{
			"title": "云数据库反脆弱性运维体系",
			"yanjiang": "构建反脆弱性的云数据库服务体系与实践，实现分布式云数据库服务的高可用方案，同时采取措施保护分布式云数据库整体服务，实现跨机房分布式自动切换方案，并在实践过程中，实施分享 SQL 自动发布，实现0误操作，有效保障云数据库服务的同时，提高了 DBA 及研发人员的效率，并完成有效数据库评价，实现完整的反脆弱数据库服务保障体系。",
			"post": "成思敏 21CN 数据库架构师/技术专家/DBA 主管",
			"jiabin": "本人长期从事数据库工作，任公司 DBA 主管，数据库架构师，技术专家等，擅长数据库整体架构的构建，数据库自动化运维设计，早期介入数据库服务研究，长期从事在云计算下的数据库运行情况难题解决，并长期公司内部 DBA 团队建设培养，对内数据库规范培训。"
		},
		{
			"title": "私有云数据库实践之道",
			"yanjiang": "本次分享首先从数据库技术发展角度，为大家梳理云数据库的技术特点、适用场景，为大家明确云数据库可以解决什么问题、又会带来什么问题，并总结 DBaaS、分布式数据库等技术架构与云数据库的关系。然后从实践角度出发，分享 Oracle PDB/CDB、MySQL+Docker 实现私有云数据库的技术要点，资源隔离与资源管理方式等。规模的爆发、数量的增长又会为云数据库的日常运维、性能监控、高可用等带来一系列问题，本分享最后一部分内容，将总结此类问题的解决方式，为企业构建私有云数据库提供参考。",
			"post": "吕海波 美创科技 技术专家/研究员",
			"jiabin": "ITPUB 管理版版主；出版技术书籍《Oracle 内核技术揭密》，正在著作《数据处理技术之旅》（暂定名），曾参加过多届数据库大会；IT 老兵，23年 IT 领域从业经历，十数年数据库经验，惯看IT江湖风起云涌；曾在多家巨头型互联网公司（阿里、eBay、京东）从事数据库管理、数据架构、运维自动化工作；目前主要研究数据安全、敏捷运维等方向。"
		},
		{
			"title": "云时代数据库迁移 & 容灾技术新进展与应用",
			"yanjiang": "迁移 & 容灾是数据库的强需求，传统的迁移 & 容灾技术已经发展多年，随着云时代的来临，在迁移 & 容灾的使用场景、网络、技术都有很大的变化，如何在云时代下更简单的实现数据库的迁移 & 容灾，云厂商如何通过新的技术实现弯道超车，本次 topic 主要分享阿里云在此领域的技术新进展和应用。",
			"post": "千震（付大超） 阿里云智能数据库事业部高级技术专家",
			"jiabin": "2012年加入阿里巴巴，目前负责 DTS & DBS 团队和研发，在阿里云提供迁移、同步和容灾的服务，支持阿里巴巴、蚂蚁、阿里云等异地多活单元化架构，曾负责阿里全球最大的 HBase 集群的开发和维护工作，曾先后工作于 IBM、Cisco。"
		}
	],
	"list3": [{
			"title": "爱奇艺实时数据传输服务 DBIO 架构设计与实践",
			"yanjiang": "数据库间实时数据传输服务可简化业务系统的数据架构，使其专注于业务开发。DBIO 是爱奇艺研发的数据库间实时数据传输服务，用于同异构数据库间实时复制与数据变更捕获，是业务系统数据共享的核心通道。本议题将介绍 DBIO 的设计与实现，重点分享在源和目标端故障时如何保证服务高可用、如何优雅的支持多种源与目标端系统以及如何高效运维等方案。同时，也将介绍 DBIO 在数据变更订阅、异地多活、数据归档等应用案例。",
			"post": "郭磊涛 爱奇艺 数据库服务负责人",
			"jiabin": "爱奇艺数据库服务负责人；2007年博士毕业于中国科技大学，进入中国移动研究院负责大数据平台的建设，2014年加入爱奇艺负责数据库内核、中间件及运维系统的研发，热衷于 Hadoop 生态系统优化和数据库高效运维架构。"
		},
		{
			"title": "万亿级大数据平台的建设实践",
			"yanjiang": "实时数据分析的重要性日益增长，本次分享以一个国家级大数据平台建设为例，介绍百分点的超大规模实时数据分析典型架构和实战经验。在该案例中，我们搭建了以 Kafka、Spark Streaming、ClickHouse、HBase、Ceph 和 ES 为基础的大数据平台，承载了万亿级数据的存储、处理和应用，平台支持了线上2000+亿/天，峰值500+万/秒的数据处理能力，同时平台在实时性、稳定性、异构存储能力方面也表现优异。本次分享介绍平台的设计理念、关键挑战、架构选型和技术实践，例如为何选用 Spark Streaming 流处理框架，如何结合 Spark Streaming 的特点实现数据处理的流量控制、资源配额，如何保障多中心核心存储 ClickHouse 的稳定等等，内容包括：<br>1. 万亿级实时数据分析面临的问题和挑战；<br>2. 百分点超大规模实时数据分析典型架构；<br>3. 如何基于业务场景进行组件评测和选型；<br>4. 数据平台的持续运维与监控设计和实现。",
			"post": "赵群 百分点 研发总监，大数据平台技术负责人",
			"jiabin": "2015年加入百分点，主导并负责大数据操作系统 BD-OS、数据开放服务平台、机器学习平台等多款产品的架构设计和研发；曾就职于搜狐和宜搜，从事核心架构研发工作，专注于搜索引擎、大数据、复杂业务系统的微服务架构设计，负责过新闻、小说、图片、游戏等多个垂直搜索产品的架构设计与引擎研发。"
		},
		{
			"title": "一站式流计算系统在新浪微博的应用",
			"yanjiang": "微博每天会产生海量的日志数据，业务方对数据质量和实时要求越来越高，所以我们基于 Spark、Flink 等开源框架开发一站式流计算系统。本分享介绍流计算平台的架构设计、生态建设和实践经验。",
			"post": "李洪勋 微博 高级研发工程师",
			"jiabin": "新浪微博研发中心高级研发工程师，一直从事分布式计算、高可用、大数据计算和分析工作，曾负责微博评论物料推荐和 CDN 数据多维度分析，现负责微博每秒千万级服务类数据的实时计算和数据分析，包括用户行为、视频播放行为等。"
		},
		{
			"title": "去哪儿网 MySQL 架构演变",
			"yanjiang": "在 MySQL 集群化、云服务化日益普遍的今天，数据一致性是其中必须要解决的头等大事。本主题主要是从 galera 的一致性设计方案、性能影响、冲突验证等方面来讲述它是如何彻底解决 MySQL 的一致性问题的，而如果所有问题都搬到了分布式场景中，这些问题又该如何解决呢？",
			"post": "王竹峰 去哪儿网 数据库总监",
			"jiabin": "去哪儿网数据库总监，擅长数据库开发、数据库管理及维护，一直致力于 MySQL 数据库源码的研究与探索，对数据库原理及实现有深刻的理解；曾就职于达梦数据库，从事多年数据库内核开发工作，后转战人人网，任职高级数据库工程师，目前在去哪儿网负责 MySQL 源码研究与运维、数据库管理和自动化运维平台设计开发及实践工作，是 Inception 开源项目及《MySQL 运维内参》的作者，也是国内少数几个 MySQL 方向的 Oracle ACE 之一。"
		},
		{
			"title": "PostgreSQL 在 5G 网管中的应用",
			"yanjiang": "2019年是中国 5G 试商用元年，各运营商将陆续开始进行 5G 实验局测试。5G 接入网和核心网包含大量的网元设备，网管系统需要对这些设备进行管理，中兴通讯 5G 网管系统 UME 采用 PostgreSQL 存储这些海量运维管理数据，包括配置数据、告警信息、设备状态等。UME 基于云平台架构实现，这就要求 PostgreSQL 数据库支持云原生部署方式，并在云环境中提供高可用性，在实现过程中需要解决诸如节点漂移、数据不一致等难题。其次，由于网管业务应用场景复杂多样，既包括在线交易类场景（OLTP），又包括统计分析类场景（OLAP），在满负荷情况下，这2种场景对 CPU、IO、内存等资源均有较大消耗，因此，如果全部读写请求都路由到 Master 节点，会导致它难以承受。此时是否可以考虑把相对空闲的 Slave 节点充分利用起来，让它承担一些只读事务呢？读写分离可以较好地解决这个问题，为此我将分享我们在这方面的一些实践经验和得失。此外，5G 网络对可靠性具有非常高的要求，必须保证在主站点发生各种安全事故情况下能够快速切换到备站点，并保证数据完整可用，这要求 PostgreSQL 数据库支持异地容灾特性，我将与大家一起探讨两地三中心方案的实现机制及其关键技术点。",
			"post": "陈河堆 中兴通讯 数据库平台负责人",
			"jiabin": "中兴通讯数据库平台负责人，PostgreSQL 中文社区委员，从事数据库研发设计工作十几年，先后参与公司自研高性能内存数据库、NoSQL 分布式数据库、金融级分布式关系数据库、分布式缓存等系统的设计和开发工作，对开源数据库 PostgreSQL 和 MySQL 有一定的研究和维护经验。"
		},
		{
			"title": "智行 LBS 的 Learning to Rank 模型 - 酒店排序模型为例",
			"yanjiang": "介绍酒店排序的 L2R 算法。首先，介绍酒店多种搜索场景下的排序目标的定义。然后，分别介绍 Pointwise, Pairwise, Listwise 模型在酒店排序不同场景的实践和比较。其次，介绍 Relational Ranking 方法在提高搜索结果多样性方面的用作和 Query dependence Ranking 方法在不同搜索条件下改变因子权重的作用。最后，介绍实践中样本生成和特征选择的问题和解决方法。",
			"post": "陈晓龙 携程旅行网 地上交通 BU 数据算法组负责人和智行数据算法组负责人",
			"jiabin": "毕业于武汉大学遥感专业（硕士）和数理统计专业（本科），现任携程旅行网地上交通BU数据算法组负责人和智行数据算法组负责人，之前任职于 eBay 和伦敦专车公司 Kabbee，拥有丰富的大数据和机器学习的应用经验。"
		},
		{
			"title": "陌陌直播推荐的0到1",
			"yanjiang": "作为社交直播行业的领军者，陌陌直播依托于开放式社交平台所承担的职责不同于社交和短视频推荐，需要在内容分发、社交匹配和营收目标上进行综合考虑。如何进行多目标分发的问题抽象和预估建模，以及针对业务的独特性进行深入理解是这个场景中的重点。本次演讲将首先介绍陌陌直播业务和推荐系统的整体架构，然后对用户及主播的多角度 Embedding 表征学习、多预估目标的 Rank 策略研发进行重点介绍，希望能够给对陌陌直播产品以及推荐策略分发算法感兴趣的同学起到抛砖引玉的效果。",
			"post": "李波 陌陌 内容推荐算法负责人",
			"jiabin": "陌陌内容推荐算法负责人，带领团队将陌陌直播推荐策略体系进行了从0到1的构建，团队获得2018年公司级团队奖；2013年中科大硕士毕业后加入搜狗广告技术团队，在广告触发、广告相关性、信息流推荐等领域有丰富的策略研发经验。"
		},
		{
			"title": "爱奇艺信息流广告的个性化探索与实践",
			"yanjiang": "随着大数据和人工智能的技术进步，数字营销行业也在不断变化。广告主对品效合一的追求促使信息流广告成为行业热点。得益于雄厚技术实力，爱奇艺信息流广告得到蓬勃发展，实现了海量触达、定向精准、效果显著的广告投放，为广告主提供跨平台、多终端的网络推广服务。本次主要从信息流广告算法系统框架、点击率预估、oCPM 和深度学习四个模块，分享爱奇艺信息流广告个性化方面的思考与实践，聚焦广告排序算法，希望能为大家带来一些启发。",
			"post": "黄蔚 爱奇艺资深算法专家",
			"jiabin": "爱奇艺资深算法专家，专注于高精度、高泛化能力的广告算法构建。依托爱奇艺海量视频内容及优质流量资源，致力于打造业内一流的信息流广告算法体系，服务于数亿用户的市场。"
		},
		{
			"title": "内容推荐在电商的应用",
			"yanjiang": "介绍内容在电商体系中的定位和作用以及二者如何结合，叙述电商内容推荐搜索的体系建设和算法迭代优化的历程。重点介绍如何构建以深度学习为主的电商内容技术体系，包含内容生成，内容理解，在线深度学习的分发系统，实时端上学习和精细数据反馈。同时涵盖电商内容的业务考虑，产品迭代和指标体系设计。最后探讨了电商内容未来面临的核心技术和业务挑战。主要面向人群：算法工程师/产品经理。",
			"post": "王国鑫 阿里巴巴高级技术专家",
			"jiabin": "阿里巴巴高级技术专家，工作领域涉及到商品搜索，内容生成和理解，内容推荐等。"
		},
		{
			"title": "智能网联技术及实践",
			"yanjiang": "人工智能在汽车领域快速落地，会产生比车辆本身更大的价值。本议题会分享：<br>1. 汽车及其供应商生态<br>2. 智能网联的智能应用场景<br>3. 智能网联用到的大数据 AI 技术<br>4. 最佳的智能网联产品模式",
			"post": "时金魁 华为 高级技术专家",
			"jiabin": "Scala 程序员，高级技术专家，目前专注于智能网联车领域，负责华为云汽车解决方案产品。Spark 和 Flink 早期研究者，多年从事高性能计算和大数据方面的工作，负责开发过多个云产品。曾先后就职于搜狐/阿里等互联网公司。出版记录：2017年翻译出版了《Spark GraphX 实战》。"
		},
		{
			"title": "网易 CockroachDB 的云化实践",
			"yanjiang": "CockroachDB 是目前业界领先的 NewSQL 解决方案之一，基于 RocksDB，使用 PostgreSQL 协议，具有性能高、支持强一致性分布式事务、支持横向扩展、部署简单等特点。网易对 CockroachDB 做了大量调研，测试了它的性能、可靠性、适用范围，并且上云，做到了自动化部署。",
			"post": "段正域 网易游戏 资深系统运维工程师",
			"jiabin": "2008年毕业于南京大学；2008-2009在苏州阳承有限公司担任运维工程师；2009年加入网易，先后负责过邮箱、DNS、游戏、网络等项目；2018年开始，负责网易游戏 SQL 类型的数据库的运维平台，为网易游戏提供 SQL 类型数据库的运维和DBA服务。"
		},
		{
			"title": "NoSQL 数据库最新技术发展趋势",
			"yanjiang": "企业 IT 系统面临层出不穷的新业务，安全，成本等诸多挑战。阿里云 NoSQL 数据库通过与企业业务深度结合，快速创新，提供最新的技术帮助企业用户迎接挑战，获得金融、社交、直播等众多大客户的信任。本次演讲重点介绍阿里云 NoSQL 数据库在全球分布式，多模，弹性，HTAP，cloudNative，图，时序，时空等众多最新领域的创新和技术实践。",
			"post": "所在（朱洁） 阿里云智能数据库事业部高级产品专家",
			"jiabin": "阿里云智能数据库 NoSQL/NewSQL 产品线产品负责人，10年数据库/大数据研发管理经验，专注于数据库/大数据服务平台建设、规划和实践应用，著有《大数据架构详解：从数据获取到深度学习》一书。"
		},
		{
			"title": "实践与展望 - 阅文无迁移分布式数据库的最佳实践",
			"yanjiang": "在阅文的内容中心，虽然我们自研了大部分分布式中间件，但数据库我们依然使用 MySQL，因为目前海量的数据与业务关系，我们构建了分布式数据库，但我们的构建方法可以说非常的不走寻常路：我们的分布式数据库不会因为数据增长而重新平衡数据。这对于构建分布式数据库来说简直比”天上掉馅饼”还有诱惑力。那么我们是如何实现而又为何这样构建？如果万不得已需要迁移数据又怎么去做？在分布式数据库上层，我们又如何构建分布式的细节屏蔽？数据分开存储后，我们又如何对数据聚合的需求进行支持？我们在这里等着你来一探究竟...",
			"post": "徐海峰 阅文集团 首席架构师",
			"jiabin": "目前集团内技术级别最高者；行走互联网江湖十多载，具有10年以上的系统架构经验与中间件开发经验；曾任5173分布式存储架构师、携程国际机票计价引擎架构师；擅长复杂业务系统架构、中间件开发、高性能运算、分布式存储与计算等；并从5年前开始，兼职从事顾问与讲师工作，多次受邀前去北京、深圳、成都、台湾等地进行技术交流；目前拥有技术专利一项，在申请中专利二项。"
		},
		{
			"title": "微信 Infinity 数据库：跨越数千公里的数据强一致性",
			"yanjiang": "Infinity 是微信自研的新一代分布式数据库，存储层是微信自研的分布式文件系统，计算层基于 LSM 存储引擎的类 SQL 实现，该架构实现了计算存储分离，保证服务高可用和数据强一致的同时，具备快速伸缩的能力，其中计算层伸缩速度达到十秒级别。Infinity 支持分布式跨表事务，对地域有较强的感知能力，使得数据即使部署在远距离的城市之间，也能提供较低服务延迟。本次演讲将介绍 Infinity 在设计实践中的要点难点，以及其中的权衡思考。",
			"post": "郑建军 腾讯 高级工程师/基础平台组负责人",
			"jiabin": "腾讯高级工程师，负责微信分布式存储研发；亲历了微信存储架构的发展，其中作为 PaxosStore 分布式数据库主创人员之一，对核心存储系统（消息、朋友圈、好友关系链等）进行升级改造，提升了服务的可用性和数据的安全性；并在 VLDB2017 发表论文 PaxosStore：High-availability Storage Made Practical in WeChat。"
		},
		{
			"title": "安可数据库云平台建设的核心需求及应对技术",
			"yanjiang": "安全、可靠地使用各种技术服务企业发展，是企业的内在需求，也是国家对技术发展的方向指导。随着 MySQL 等开源数据库的广泛使用和云服务的深入人心，越来越多的企业开始着眼于搭建自己的数据库云平台服务，以期能够安全、便捷、高效的使用数据库。在搭建云平台的过程中，除了一些 Web 化的自动化操作外，更重要的是针对数据库自身的管理和运维，以及云原生数据库的打造。本次分享针对几个技术要点展开讨论，介绍在搭建数据库云平台建设的过程中需要注意的若干技术要点，以及云原生数据库在物理复制、分布式弹性扩展等等关键技术的思路。",
			"post": "周彦伟 极数云舟 CEO，Oracle ACE Director(MySQL)",
			"jiabin": "中国计算机行业协会开源数据库专业委员会会长，曾在去哪儿网、人人网等互联网公司工作多年，专注于 MySQL 以及分布式数据库核心技术实现和社区推广，著有《MySQL 运维内参》，被业内从业者视为 MySQL 面试宝典，译著有《Learning HBase》《MySQL 8 Cookbook》；2018年创办极数云舟，提供安可数据库产品和技术服务。"
		},
		{
			"title": "以数据资产为核心的京东安全纵深防御体系",
			"yanjiang": "京东作为大型互联网电商公司，保障用户的信息安全是最重要的企业责任和使命之一。演讲将提出当今面临的新型安全威胁和攻击手段，以及黑色产业链发展的新趋势。并重点分享京东以数据资产为核心的纵深防御体系，结合京东多年攻防实战经验，从主动防御、全场景监控和响应、溯源打击等多维度保障京东用户的信息安全。",
			"post": "洪敬风 京东 技术总监",
			"jiabin": "现任京东信息安全技术总监，负责数据安全、威胁监控、网络和系统安全、用户安全和反诈骗等方向的研究和开发；10年计算机安全和软件研发工作经验，先后在外企和互联网公司担任高级研究员、亚太安全实验室负责人和技术总监等职务；主要研究方向包括网络安全、Web 安全、数据安全和业务安全等；曾主导过多项安全技术和产品的研究和开发，取得了较好的行业竞争力和市场成功。"
		},
		{
			"title": "58到家集团数据安全体系建设探索与实践",
			"yanjiang": "58到家集团是以提供上门服务为核心业务的互联网生活服务平台，自成立以来始终致力于为用户及劳动者提供更专业更放心的服务，本次分享主要围绕到家集团作为一个创业型互联网企业，面对当今的层出不穷的安全威胁，为保障用户及劳动者信息安全，在数据安全体系建设道路上从0到1探索与实践。",
			"post": "刘欢 58到家 安全负责人",
			"jiabin": "乌云时期白帽子，毕业后进入乙方安全公司启明星辰，所参与过的安全建设项目覆盖政府、军工、运营商、银行、互联网企业等多个行业；后加入光大等甲方从事企业安全建设；2017年加入58到家集团担任安全负责人，负责安全防护体系的建设，目前主要研究方向业务安全与数据安全。"
		},
		{
			"title": "数据库泄露事件解读与 PostgreSQL 安全防护",
			"yanjiang": "12306数据泄露，汇丰银行数据泄露，华住酒店开房数据泄露，360数据泄露，顺丰3亿客户信息泄露。如何抵御外部攻击？如何防止内部人员数据泄露？我们的数据库是否在裸奔？发现安全隐患，加固你的数据库，正是本专题讨论的重点。本专题除了涉及 Oracle、DB2 等商业数据库之外，还涉及开源数据库 MySQL、PostgreSQL 等数据库的安全探索和加固。",
			"post": "赵振平 太阳塔科技 CTO",
			"jiabin": "太阳塔科技 CTO、PostgreSQL 中国社区主席、腾讯最具价值专家（TVP）、数据库专家、大数据专家、电子工业出版社签约作家、电子工业出版社30周年优秀作者、贵州省省管专家、国家首批大数据高级职称，出版了技术专著《Oracle 数据库精讲与疑难解析》、《成功之路：Oracle 11g 学习笔记》。"
		},
		{
			"title": "基于网络空间大数据的安全攻防技术实践",
			"yanjiang": "网络空间测绘技术近几年兴起，通过对全球网络 IP 的探测、分析、识别而形成的大数据，有许多内容等待挖掘。白帽汇专注网络空间测绘，结合多年的安全技术研究对网络空间大数据进行挖掘与利用，从实践中不断积累攻防技术。此次分享将讲解网络空间大数据的攻防技术，掌握快速、精准、无感知的攻防技术。",
			"post": "吴明 华顺信安 安全总监",
			"jiabin": "2006年接触网络安全；2008年发表技术文章至《黑客X档案》杂志；2014年加入奇虎360，研究基于机器学习的 Webshell 查杀；2016年加入白帽汇，专注于漏洞挖掘与分析、基于网络空间测绘技术研究。"
		},
		{
			"title": "Oracle 数据安全之异构同步和审计",
			"yanjiang": "从数据安全方向，分享 RDS（Realtime database sync）技术，对 Oracle 数据库的数据及事务操作进行异构同步，实现备份，审计。本技术以分析 Oracle 的 REDO 和归档文件，解析以文件中的真实数据和操作流程。对源库除了开启表级归档功能外，不会对源库执行写操作，将对源库依赖降到最小。备份过程可以支持异构，基于时间戳、安全策略、数据记录版本。在对数据操作的过程中可以对数据库的 DDL、DML 操作和审查和权限控制，以达到保证数据的安全性的目的。",
			"post": "鲍磊 青松云安全 系统构架师",
			"jiabin": "撸得起软件，搞得定硬件！作为一个熟悉软件、硬件资深C程序员。对操作系统底层有较深的认知和理解。一个系统级回归的极客，实操型战士，爱技术钻研，充满求知欲。干的全是“苦”活，却乐在其中的人。"
		},
		{
			"title": "有赞数据库经典优化案例",
			"yanjiang": "介绍我们支持业务运维过程遇到的经典性能优化案例，涵盖 SQL、网络、存储方面的优化场景，总结解决问题的思路，抛砖引玉。",
			"post": "王航威 杭州有赞科技 DBA",
			"jiabin": "有赞 MySQL DBA，主要负责数据库的性能问题的优化和解决以及数据库自动化运维平台的编写，熟悉 MySQL 索引和体系结构。"
		},
		{
			"title": "MySQL 内核架构性能优化",
			"yanjiang": "性能是数据库永恒的主题，TPS 指标就是业务的生命。试想客户是否愿意花喝一杯咖啡的时间等待一次转账？答案一定是 NO!!! 因此，作为信息化核心之一的关系型数据库，在其诞生的那天开始，提升性能就成为了开发人员的使命。如最流行的数据库 MySQL，从5.6、5.7到最新的8.0，每一次让人瞩目的版本更新都围绕着架构调整后的性能改进。如果我们能不断提高 MySQL 性能，突破 TPS 上限，还有什么比这更令人感到刺激和兴奋？作为长期进行数据库研发的企业，我们将带您进入 MySQL 架构级和源码级优化领域，展示我们对 MySQL 的研究成果，邀请各位和我们一同分享如此美妙的大餐。",
			"post": "姜宇祥 专家级数据库研发工程师",
			"jiabin": "MySQL 开源数据库源码专家，主攻方向 MySQL 复制及高可靠性；拥有十余年的数据库领域一线研发经历和传统软件公司数据库系统以及互联网公司开源 MySQL 数据库系统相关的产品研发和落地经验；研发成果包括 ODBC 各类数据库系统接口，备份还原系统工具，MySQL 5.6 异步复制改造，时间序列存储引擎以及数据库审计插件等；在数据库理论、数据库架构等方面，具有极其丰富的实践经验，并曾在多个数据库会议上进行数据库开发实践的主题分享，是国内数据库行业内资深从业人士。"
		},
		{
			"title": "并行不悖 - Oracle 数据库并行的是是非非与新特性",
			"yanjiang": "在数据库的世界里，并行计算可以极大的提升性能，改善应用的响应时间，但是并行的使用又往往不容易掌握，有时候甚至会引起数据库的性能问题。在这个主题中，将和大家分享 Oracle 并行原理，解读并行执行计划，分析并行的最佳使用方式和场景，展示并行经常会碰到的常见问题案例，以及 Oracle 12.2 版本之后 Oracle 引入的并行新特性。",
			"post": "云和恩墨 CTO，ITPUB 版主，Oracle ACE 总监",
			"jiabin": "ITPUB Oracle 数据库管理版版主，人称“杨长老”，曾十数年如一日坚持进行 Oracle 技术研究与写作，号称“Oracle 的百科全书”，迄今已经在自己的博客上发表了超过3000篇技术文章；2010年，与 Eygle 共同主编出版了《Oracle DBA 手记》一书；2007年被 Oracle 公司授予 ACE 称号。"
		},
		{
			"title": "MongoDB 优化与脱坑最佳实践",
			"yanjiang": "近几年分布式或者说 NoSQL 数据库的兴起，让全球数据库排名第五 NoSQL 排名第一的数据库 MongoDB 越来越多被大家所熟知。但如何用好 MongoDB 很多人并不是太擅长。本次主题将会较为全面的为大家分享 MongoDB 的核心特性、架构选项、踩坑经验及通用优化方式等，希望能让大家对 MongoDB 有一个全新的认识。",
			"post": "李丹 罗辑思维 首席 DBA",
			"jiabin": "罗辑思维首席 DBA 及 MongoDB 中文社区北京分会主席；近10年专职数据库从业经验，主要从事 MySQL、MongoDB 自动化运维及私有云平台建设，专注于开源数据库 MySQL、MongoDB 等相关技术领域的学习与研究。"
		},
		{
			"title": "网易海量对象存储运维服务体系构建",
			"yanjiang": "网易对象存储(NOS)是网易自研的对象存储服务，支撑了包括云音乐、有道云笔记、网易新闻等业务的海量静态文件存储服务。本次分享主要从运维的角度介绍 NOS 内部如何打造一个高可用、高可靠、可扩展的运维服务体系，以支撑 NOS 底层的分布式元数据库、分布式文件系统等模块随着业务不断进行的快速扩张与架构调整，具体内容包括：系统架构演变、访问限流技术、流量与数据隔离、跨机房高可用、智能容量评估与全链路问题追踪等。",
			"post": "潘威 网易 对象存储服务运维负责人",
			"jiabin": "北京工业大学硕士毕业，2012年加入网易，负责数据库、分布式文件系统的运维工作，有丰富的大型项目运维架构设计与实践经验。参与负责过易信、网易邮箱附件、网易云对象存储 NOS 等项目的运维管理工作。"
		},
		{
			"title": "京东物流超大规模仓储系统数据库集群大促保障秘诀",
			"yanjiang": "京东物流极速的购物体验背后隐藏着怎样的秘诀？仓储和配送时效是其中最为关键的一环。京东物流超强仓配体系，特别是在电商行业中独有的超大规模仓储系统集群，在其中起到了决定性的作用。当前京东的库房已经遍布全球，京东仓储管理系统（简称 WMS 系统）是最核心的生产系统，涵盖了从在库，入库，出库等等环节。而作为系统最末端的数据库，不仅仅承担着存储数据的任务，还是系统可用性的最后一道防线。如何保证仓储系统数据库的高性能和高可用，直接决定了库房生产是否能顺畅进行。在本篇我们将会详细介绍京东物流仓储系统的数据库架构，以及如何通过运维自动化平台、性能优化、故障自愈、数据结转和升级扩容等步骤进行大促的系统保障。",
			"post": "高文佳 京东物流 资深 DBA",
			"jiabin": "2014年加入京东，负责京东商城 SQL Server 和 MySQL 数据库运维，擅长数据库性能优化，故障处理和自动化运维平台开发，历经多次京东618和双11大促保障护航，现担任京东物流基础保障部资深 DBA，带领团队从零搭建数据库运维体系和平台。"
		},
		{
			"title": "TDSQL 智能运维平台 - 扁鹊架构与实践",
			"yanjiang": "TDSQL 作为腾讯推出的金融级分布式数据库，在公司内外有大量客户，如果没有高效的智能化运营平台则在系统出现异常的时候处理起来非常棘手；而扁鹊就是希望能解放 DBA 同学的大脑和双手，让运营工作变得轻松，比如通过扁鹊可以轻松评估数据库的健康状态，对主备切换，主备延迟等 DB 异常状况进行自动化的原因分析，低效 SQL 的自助优化等等。本主题将会重点介绍扁鹊的设计思想，如何帮助 DBA 同学提高运营效率。",
			"post": "雷海林 腾讯 金融云 T4 专家",
			"jiabin": "11年的分布式数据库内核开发和运营经验，目前是腾讯金融数据库 TDSQL 的研发负责人。"
		},
		{
			"title": "Canal 的自动化运维以及异地容灾系统实践",
			"yanjiang": "MySQL 数据源间的数据实时同步以及 MySQL 海量数据的数仓建设和实时检索是大数据平台里常见的问题，传统数据库的运维方式很难满足大数据场景下的稳定性和高效性。Canal 作为中间件解决了 MySQL Binlog 的获取。但当 MySQL 机房、数据源众多且实例调整比较频繁时，例如扩容、迁移、主从切换等，给 Canal 的运维提出了较大的挑战。本次演讲主要分享了字节跳动对于 Canal 的智能化运维，自动感知数据库的变更和主动适配，并提出多机房部署及异地容灾解决方案，实现了多机房 Canal 实例的统一智能管理。",
			"post": "李畅 字节跳动 高级大数据平台工程师",
			"jiabin": "16年加入字节跳动，任高级大数据平台工程师；擅长大数据处理和平台的建设，对 Canal 自动化运维以及异地容灾有深入研究。"
		},
		{
			"title": "机器学习在数据库运维上的应用",
			"yanjiang": "京东线上在线服务的数据库集群数以万计，平均每天新申请的容器数量高达1k多台，如此高频率的资源申请以及释放，如何做到能够让资源精准分配，并且做到提前防范，基于机器学习的京东智能运维平台 SmartDBS 系统在逐步化解这些难题。SmartDBS 系统包含5大模块：分类，预测，诊断，决策，调度。每个模块功能逻辑独立，分类、预测、诊断的数据最终进入决策模块参与容器资源分配的决策，并推送进入调度实现资源的重新合理分配。在本篇当中将详细介绍 SmartDBS 的系统架构，核心设计原则，以及各个模块之间的交互。",
			"post": "彭安 京东商城 开发工程师",
			"jiabin": "14年加入京东，开始软件开发职业生涯，期间研究 nginx、redis、memorycache io 模块代码，对 server io 和分布式系统有一定的认识；项目开发过程中以 java，go 为主；在职期间合作完成京东统一实时日志订阅系统，数据库差异备份系统等，目前的主要研究方向是智能运维。"
		},
		{
			"title": "便利蜂数据库运维自动化从0到1演进之路",
			"yanjiang": "介绍便利蜂数据库运维自动化建设过程中遇到的问题和解决思路。主要包括核心系统如备份系统、慢查询系统、在线变更系统、在线查询系统、MySQL高可用系统等的实现与推进过程。",
			"post": "陈海峰 便利蜂 DBA",
			"jiabin": "便利蜂DBA，负责便利蜂数据库稳定运行及数据库自动化建设工作；曾在美团工作3年，负责美团外卖、配送、支付等业务数据库运维，见证美团外卖千万订单增长和数据库架构演进整个过程。"
		},
		{
			"title": "苏宁数据中台架构实践",
			"yanjiang": "数据中台概念在18年随着 ToB 的兴起，越发火热，透过现象看本质，数据中台本质还是为了更好的将数据服务出去，支撑业务。但数据不是从天而降，数据的产生涉及：业务部门、数据采集、ETL、计算、存储等多个环节，数据质量、数据管理、数据建模、数据口径一致性，也严重制约着对外服务能力。</br> 正因为数据本身的复杂性，数据中台应运而生，通过系统化、产品化的方案，帮助我们管理数据、与业务打通，将数据服务出去。苏宁数据中台的建设构想，始于16年底，在17年6月启动，经过2年左右的建设，已经初见成效，在这过程中我们不断完善对数据认知、对业务的认知，我们越发相信，数据中台本质提供的是对数据的认知能力。",
			"post": "翟小青 苏宁易购 IT 总部高级技术经理",
			"jiabin": "现担任苏宁易购大数据中心高级技术经理，加入苏宁以来一直从事数据中台系统研发，致力于通过系统化、产品化的方案，帮助我们管理数据、与业务打通，将数据更好、更快捷的服务出去。不仅对 Druid、ES、Spark 等数据分析引擎，有深入了解，对数据分析的业务场景也有丰富的认知。"
		},
		{
			"title": "大数据时代的数据治理",
            "yanjiang": "本演讲以大数据时代的数据本身所具有的特点以及数据应用的难点为出发点，系统的介绍了大数据时代数据治理的主要组成部分，以及各部分应当具备的主要功能。同时，本演讲也介绍了部分行业典型的数据治理案例，从而为大家带来解决大数据应用困难的一些思路与启发。",
            "post": "薛勇 石竹软件 总经理 ",
            "jiabin": "薛勇先生毕业中国人民大学，获得硕士学位；有着近20年的IT从业经验，从事数据治理工作将近15年，是国内最早一批从事数据治理产品研究与推广的人；参与并见证了中国数据治理市场从起步到全面暴发的全过程；从2004年国内第一个元数据项目开始，15年来参与的数据治理项目有：中国移动总部、中国移动25个省公司、中国电信总部、中国联通总部、中国银行总部、中国农业银行总部、烟草总局，山东地税、江苏国税、中航信、中央债券结算、人民银行征信中心、民生银行、华润集团、中信集团等，将近上百个大型企业的数据治理项目；薛勇先生拥有 IPMP C 级证和高级项目管理师等专业资质，同时获得两项数据治理的专利。"
		},
		{
			"title": "数据治理方法论及实践",
			"yanjiang": "当前教育行业大数据发展迅速，数据质量问题严重阻碍着大数据的价值呈现，而数据治理迫在眉睫。在这个主题里，主要分享在围绕智学网的数据仓库建设过程中，遇到的一些数据问题及相关解决方案，围绕这些案例，构建一些工具的方法论，更好的支撑数据治理的落地。",
			"post": "王龙生 科大讯飞  教育事业群中台数据部门经理",
			"jiabin": "教育事业群中台数据部门经理，主导完成了讯飞教育大数据仓库系统建设及数据治理相关工作，构建了智学网的数据运营系统。"
		},
		{
			"title": "美团配送实时数仓建设实践",
			"yanjiang": "美团配送是业界领先的智能物流平台，拥有全球领先的实时配送网络，为用户和商家提供任意时间的即时配送、同城配送和跑腿配送服务。美团配送业务的快速发展，从系统的稳定性、高并发到对数据质量的高要求和高实效性，对技术研发带来了更多的挑战。美团配送在配送时长1小时以内，平均配送时长约30分钟的即时配送业务，过程涵盖了用户、商户、骑手和平台互相交错的四元关系，美团配送技术团队建立了配送的“超脑”配送系统，从用户下单，商家接单到骑手的接单送达，进行准确的时间、运力的预估，通过动态定价、智能派单、网络规划等系统来提升配送效率、优化用户体验、降低配送成本，对于实时数据需求的效率和质量都带来极大的挑战。本次分享主要为大家介绍配送实时数仓的发展历程、关键技术和成功实践。",
			"post": "李金康 美团 大众点评高级技术专家",
			"jiabin": "2013年加入美团，现任美团配送数据组数据应用组负责人，长期负责配送数据架构的系统开发与架构升级，主导配送实时数据建设、配送 BI 系统建设、实时特征平台建设，为全国海量骑手及各级管理团队和算法团队提供信息化支持；拥有多年互联网研发及技术管理经验，在大数据、高并发、高可用架构设计等领域积累了丰富的经验。"
		},
		{
			"title": "并行不悖 - OLAP 在互联网公司的实践与思考",
			"yanjiang": "互联网业务，通常以保障高并发、高性能、大容量的 OLTP 业务为第一要务，但与之相关的，各种 OLAP 需求也是对公司运营、发展状态的直观展示和反映，也是至关重要的数据库功能。如果简单的将这两大类需求在一套数据库中实现，则很容易产生各种问题，比如性能问题、容量问题。那么如何解决这些问题，响应好各种需求？如果设计和实践 OLAP 架构，让两大类需求相互关联并行不悖？从数据角度看，这些需求的本质是什么？本次演讲，就分享一下我在互联网公司的 OLAP 实践与思考，使用 Greenplumn 和 PostgreSQL 的经验和注意事项，希望能给大家带来借鉴和启发。",
			"post": "赵飞祥 斗鱼网络 资深 DBA",
			"jiabin": "现在斗鱼网络从事数据库相关工作，Oracle 10G OCP，11G OCM，Oracle YEP 年轻专家，8年数据库运维和架构经验，对 MySQL、Oracle、PostgreSQL、Greenplum、MongoDB 等多种常见数据库有丰富的运维实践经验，掌握与数据库相关的前后端架构和 DevOps 实现技术，擅长数据库架构设计、维护优化、数据流转、Shell 和 Python 开发；乐于技术交流，以网名 yumushui 进行了大量的技术总结和思考分享。"
		},
		{
			"title": "用大数据来优化数据管理与数据湖建设",
			"yanjiang": "1. 滴滴数据建设概述；<br> 2. 如何将大数据+NLP+知识图谱技术用于数据管理与数据湖内容建设；<br> 3. 对数据平台智能化的设想。",
			"post": "张茂森 滴滴出行 数据专家",
			"jiabin": "滴滴出行数据专家，2017年加入滴滴出行，负责滴滴数据平台部门工作，之前在阿里巴巴负责大数据产品与平台的研发工作。"
		},
		{
			"title": "HugeGraph 开源图数据库技术",
			"yanjiang": "在 NoSQL 领域，从最近十年的表现来看图数据库已经成为关注度最高，发展趋势最明显的数据库类型。HugeGraph 是百度自主研发的一款图数据库，在百度安全事业部的反欺诈、黑产打击业务中发挥了重要作用，并以此为基础，逐步扩展完善成为可以支持广泛图数据库需求场景的通用图数据库，于2018年开源。本报告将结合过去几年的实践经验，分享 HugeGraph 图数据库的典型应用场景、高效使用方法、技术选型、技术架构、技术挑战与难点等方面内容。",
			"post": "李章梅 百度 HugeGraph 图数据库技术负责人",
			"jiabin": "现任百度安全事业部资深研发工程师，HugeGraph 图数据库技术负责人；曾任职于华三通信、EasyStack 从事云计算与分布式存储相关研发工作；2012年毕业于河北科技大学，2015年开始持续贡献开源社区，包括 OpenStack、Ceph、ScyllaDB、TinkerPop 等社区，个人 GitHub 主页地址：https://github.com/javeme。"
		},
		{
			"title": "探索互联数据的奥秘 - 图数据库 GDB",
			"yanjiang": "阿里图数据库 GDB 是一种支持属性图模型、用于处理高度连接数据查询与存储的实时、可靠、可扩展的在线数据库服务。基于图数据库 GDB，可以帮助用户快速构建基于高度连接的数据集的应用程序，高效地构建社交网络、推荐引擎、欺诈检测、知识图谱等应用。",
			"post": "夜炎（王炎）阿里云智能数据库事业部高级技术专家",
			"jiabin": "阿里云智能数据库事业部高级技术专家；在分布式系统、存储领域以及 NoSQL 系统研发领域经验丰富；18年加入阿里巴巴集团，现在阿里负责图数据库系统相关研发工作。"
		},
		{
			"title": "分布式图计算的快速故障恢复技术",
			"yanjiang": "分布式图处理系统需要不断增加节点数目，来应对数据规模不断增加所带来的计算挑战。计算节点的增加在加强系统算力的同时，增加了系统故障的概率，因此，急需一种有效的故障恢复策略。该报告探讨提出一套基于检查点+日志的快速容错方案，用以加快“以顶点为中心”的分布式图处理系统的错误恢复速度。在该方案中，无需重新计算所有数据，只需对分布在故障节点上的数据重新分区，分配到集群节点上进行并行恢复即可，从而加快系统的故障恢复速度。另外，为进一步加快故障恢复速度，探讨对提出的方案进行了进一步优化，如根据 cost model 进行分区、采用数据压缩减小通信和 I/O 代价等。实验表明，在运行在40个计算节点的分布式图处理系统上，本项目提出的基于图数据自适应迁移算法、基于数据特征的图划分最优算法的故障恢复策略，能比现有的工作平均快32倍。相关工作发表在数据库顶级会议和期刊：VLDB‘2015 和 TKDE‘2018。<br>大纲：1、分布式图计算故障恢复的研究背景；<br>2、分布式图计算故障恢复问题的定义；<br>3、分布式图计算的总体架构与故障恢复技术实现。",
			"post": "卢卫 中国人民大学 中国人民大学副教授",
			"jiabin": "卢卫博士拥有多年海外留学和工作经历，先后于2007年在澳大利亚昆士兰大学数据与知识工程研究（DKE）团队和2010年在新加坡国立大学数据库研究团队进行学术访问；2011年在中国人民大学获得博士学位后，于2011年7月至2014年9月在新加坡国立大学计算机学院从事博士后研究工作；是2012年中国人民大学优秀博士学位论文奖和CCF优秀博士学位论文奖的获得者之一，并在 CCF A 类发表论文十余篇。"
		},
		{
			"title": "图数据库在智能问答和聊天机器人中的应用",
			"yanjiang": "本次演讲主要介绍图数据在自然语言处理场景中的应用，这里包括利用非结构化数据来搭建图数据库，利用搭建好的图数据库来赋能教育领域客服机器人，智能医疗机器人以及订餐机器人。",
			"post": "李文哲 北京贪心科技 创始人兼 CEO",
			"jiabin": "人工智能、知识图谱领域专家，北京贪心科技创始人兼 CEO，美国南加州大学博士，荷兰阿姆斯特丹大学访问学者；曾任凡普金科集团（爱钱进）首席数据科学家、北京会牛科技公司首席科学家，美国亚马逊高级工程师，美国高盛工程师等职位；在大数据、机器学习、自然语言处理、知识图谱等领域有丰富的研究和实践经验；在 AAAI, KDD 等顶会上发表过15篇左右论文。"
		},
		{
			"title": "Raft - 基于共识的分布式数据库协同算法及其在 Neo4j 集群中的实现",
			"yanjiang": "分布式数据库高可用最佳实践：</br> 1. 分布式数据库的主要挑战：CAP Theorum；</br> 2. 分布式数据库协议：Paxos 和 Raft； </br> 3. Raft协议的特点和设计思路；</br> 4. Raft 协议的重要内容：分布式日志，共识算法，Leader 及其选举，有效期(Term) ；</br> 5. Raft 的主要过程：Leader 的选举；日志复制和事务提交；处理 Leader 失联；数据安全 / 一致性；</br> 6. Neo4j 的因果集群：实现的特性；部署实例探讨；应用开发。",
			"post": "俞方桦 Neo4j  亚太地区技术专家",
			"jiabin": "Neo4j 亚太地区技术专家，IEEE 和澳大利亚计算机学会会员；二十多年IT从业历史，职责包括开发、架构、咨询顾问、技术管理，行业经验跨越政府、零售、金融、科技、制造，专注领域涉及大数据、商业智能、AI和机器学习、云计算、软件开发以及儿童编程教育；现定居悉尼，业余时间喜爱读书、旅游、美食、网球和任何新颖的科技产品，联系方式：https://www.linkedin.com/in/joshuayu。"
		},
		{
			"title": "陌陌大数据存储升级加速业务赋能",
			"yanjiang": "近几年陌陌大数据机器集群增长到超过千台的规模，随之而来对大数据体系的性能、可用性等要求也不断提高，存储系统作为底层组件更是影响整个数据服务的关键环节，本次演讲将围绕陌陌大数据存储的性能加速和可用性升级进行展开介绍。<br>1. Alluxio分布式存储系统通过自研升级，深度应用在分布式计算、存储冷热管理等方面，由此获得性能加速推动业务进展；<br>2. HDFS文件存储系统如何通过「启动模拟、镜像」等自研特性提升生产可用性；<br>3. 面向公司内部场景扩展需求，陌陌当前的大数据存储升级工作和规划。",
			"post": "金晓烨 陌陌 数据基础架构团队总监",
			"jiabin": "2013年初加入陌陌，专注于数据密集型应用的系统架构研究，致力于实现公司数据平台能力开放、数据使用赋能、高SLA数据生产保障的团队目标，推进陌陌数据平台、数据仓库以及数据服务系统等方向持续演进。"
		},
		{
			"title": "Key-Value SSD 的原理和应用",
			"yanjiang": "SSD 在过去一直被当作一个标准的块设备使用，这实际上为了兼容机械硬盘的使用方式，让运行在机械硬盘之上的软件可以不做任何修改就可以跑在 SSD 上。但这种使用方式抹杀了 SSD 的一些独特个性。上海宝存研发的 Key-Value SSD 可以直接提供 Key/Value 存储接口，颠覆了过去大家对 SSD 的认知。",
			"post": "苗宁忠 宝存科技 Chief Engineer",
			"jiabin": "Chief Engineer，带领团队研发了 Host-based SSD，Open Channel SSD，Key-Value SSD 等一系列宝存核心产品。"
		},
		{
			"title": "MyRocks 在网易核心业务上的使用和优化实践",
			"yanjiang": "MyRocks 是 Facebook 引入 RocksDB 后的 MySQL 分支版本，在 Facebook 内部得到了大规模使用，得益于 RocksDB 优秀的写入性能和数据压缩等特点，MyRocks 也受到了 MySQL 社区的极大关注，目前 Percona、MariaDB 等社区版本均已支持 MyRocks，网易杭研也在 InnoSQL 5.7.20 版本增加了 MyRocks 存储引擎。本次分享将为大家分析 MyRocks 的优点，介绍其在网易互联网核心产品的不同业务场景上的使用、参数调优、问题定位和功能优化。",
			"post": "温正湖 网易 杭研数据库内核开发负责人",
			"jiabin": "8年多数据库和存储系统开发经验，《MySQL 内核：InnoDB 存储引擎 卷1》作者之一，曾主导了网易公有云 RDS、MongoDB 等数据库云服务建设，现负责网易 MySQL 分支 InnoSQL 开发和维护；专注于数据库内核技术和分布式系统架构，乐于挑战和解决疑难问题。"
		},
		{
			"title": "数据分析加速在滴滴的实践",
			"yanjiang": "数据查询和分析的加速一直以来都是数据库和数据分析引擎追求的重要目标。起初这个目标主要是集中在 OLTP 数据库的查询场景中，OLAP 场景下以 Hadoop 为基础的平台主要的工作方向还是超大数据集的处理能力。然而近年来，随着数据驱动业务的发展，对数据及时性的要求呈现逐年提高的趋势，数据分析、数据建模等周期性的工作也逐步的日常化。在强及时性和数据量爆炸式增长的客观前提下，如何提升数据分析引擎的执行速度，就被放到了突出的位置上，本次演讲将根据滴滴在分析加速这方面的实践以及未来的发展方向，和大家做一些简要的探讨。",
			"post": "张彦龙 滴滴出行 高级数据专家",
			"jiabin": "滴滴出行高级数据专家，2017年加入滴滴出行，主要从事数据分类产品建设，之前曾在阿里巴巴、IBM 等公司从事大数据相关领域的研究和开发工作。"
		},
		{
			"title": "百度数据库压缩技术在百度网盘的应用",
			"yanjiang": "百度高性能安全数据库是百度数据库团队开发的关系型数据库，从性能、成本、安全等多个方面提升数据库的能力，缩小和商业数据库的差距。百度网盘是国内最大的个人网络存储服务。每天为数以亿计的用户，提供海量的个人数据存储服务，其中数据库承载着重要的元数据的存储。巨大的客户量带来了巨大的机器成本。百度数据库内核团队协助百度业务不断优化数据库层的存储成本和架构。通过优化 MySQL 的压缩算法和架构，大幅度的提升了 innodb 原生压缩的读写性能，使得压缩技术的上线成为可能。接下来我们大规模上线了业界公认的压缩效果最好的 tokudb，成为 MySQL+tokudb 目前为止国内最大规模的应用集群。下一步我们的目标是 rocksdb 和硬件技术，通过硬件+软件一起提升 MySQL 存储的性能和压缩率。",
			"post": "陈辉 百度 数据库资深架构师",
			"jiabin": "目前主要负责百度高性能安全数据库的开发和维护，在压缩，新硬件、性能、安全、分布式数据库等方面有丰富的项目经验。在加入百度之前从事多年DB2内核开发工作。<br>特别感谢高佳老师对此项目的杰出贡献。<br>高佳，目前是百度分布式数据库组的主要负责人，具备海量数据存储运维能力，主要负责产品线是百度网盘业务，同时在MySQL数据库存储引擎，数据压缩，性能优化，数据库集群架构上拥有丰富的运维能力和技术经验，在加入百度前从事国家安全中心国家级防火墙（GFW）系统的运维工作。"
		},
		{
			"title": "Oracle SQL 优化三板斧",
			"yanjiang": "数据库性能优化领域，熟练掌握 Oracle SQL 优化是较有难度的。本次演讲从 SQL 优化的宏观角度出发，深入浅出讲解以下问题：<br>1. 如何快速判断 SQL 执行效率有问题？<br>2. 如何快速优化 SQL？<br>3. 如何从根本性解决 SQL 执行效率不理想？",
			"post": "周亮 杭州美创科技 运维服务中心总监",
			"jiabin": "Oracle ACED；杭州美创科技运维服务中心总监，中国南方 Oracle 用户组联合创始人，ITPUB 社区管理版版主，著有《Oracle DBA 实战攻略》等书。"
		},
		{
			"title": "大规模 SQL 审核设计与实践",
			"yanjiang": "当越来越多大型企业认识到 SQL 审核重要性的时候，如何让 SQL 审核无缝嵌入到企业中，使得这项理念更好的为企业服务，将成为企业 IT 流程改进中一个重要的环节。<br>你的企业在实施 SQL 审核的时候碰到的最大问题是什么？理念问题？协作问题？还是……？<br>让我们一起来感受下，那些大型企业 SQL 审核是怎么做成功的。",
			"post": "怀晓明 云和恩墨 性能优化专家",
			"jiabin": "ITPUB 社区版主，目前专注于移动互联网领域内低成本高成效的系统架构设计实施与团队管理；是一个细心敏锐的 Troubleshooter，善于使用以搜索为主要手段去处理解决各类问题；曾获得第一届 ITPUB 最佳建议奖，并在多个大型IT企业多年的工作历练中，积累了丰富的系统架构设计经验；擅长数据库和 Web 的设计、开发，精于故障诊断与处理，具有丰富的省部级电子政务行业工作经验及项目管理经验；合著作品有《剑破冰山 - Oracle 开发艺术》、《Oracle DBA 手记 2》。"
		},
		{
			"title": "MySQL SQL 优化技巧与解析优化器原理",
			"yanjiang": "当我们提交一个 SQL 给数据库，数据库将 SQL 解析之后，生成执行计划（步骤），然后按照计划执行，执行完成之后，将得到执行结果返回给客户端。这是一个非常简单易懂的流程。甚至可以肯定，数据库会非常智能地生成最好的执行计划，以最快的速度吐出完全正确的结果。但是，在极端情况下，如遭遇 Bug ,我们可能会遇到执行效率差，甚至执行结果不正确的情况，对此，我们一般都束手无策。但事实不一定如此，如果我们对 SQL 解析器非常了解，就可以通过一些手段，干预解析器，以纠正其产生的错误，解决遇到的刺手问题。",
			"post": "徐春阳 民生银行 总行科技部高级工程师",
			"jiabin": "曾供职阿里，人民搜索，京东商城，现就职民生银行总行信息科技部运维部门系统管理中心，从事数据库运维工作；精通多种数据库理论与运维实践，在 MySQL 方面尤其擅长；从项目初期开始，全面负责民生银行分布式核心系统数据库方面相关的建设工作，助力民生银行实现IT架构的去 IOE 向云化分布式转型；热爱开源数据库技术，并乐于分享，维护个人公众号 - “数据库随笔”，帐号: MysqlPg。"
		},
		{
			"title": "MySQL 全量 SQL 性能分析与审计实践",
			"yanjiang": "基于 Performance Schema 构建的 MySQL 全量 SQL 性能分析与审计平台，平台主要包含了 MySQL 源码功能扩展、数据采集、数据加载与计算、数据可视化展示模块，实现了全量抓取 MySQL 的执行语句，进行汇聚分析，达到了 SQL 语句粒度的秒级监控，结合数据库实例的性能计数器指标，对于性能上每一次明显的波动，可以准确定位到数据库语句的问题所在。",
			"post": "王栋 携程旅行网 数据库专家",
			"jiabin": "携程技术保障中心数据库专家，对数据库疑难问题的排查和数据库自动化智能化运维工具的开发有浓厚的兴趣。"
		},
		{
			"title": "SQL 改写优化妙手集锦",
			"yanjiang": "有 IT 的地方就是数据库，有数据库的地方就有 SQL，有 SQL 的地方就有 SQL 优化，有需要 SQL 优化的地方就伴随着痛苦。此外 SQL 优化需要考虑的东西很多，从架构到参数优化到模型优化到代码优化……这其中，编写高效 SQL 代码可以说是特别重要的环节，同时也是尽情发挥想象，最有创造力，最有乐趣的一件事：比如原本数十次的表访问，瞬间化作单次表访问收场；比如原本上千行代码完成的逻辑，转眼变身单条 SQL 语句搞定；比如复杂 SQL 被精简的面目全非，性能却忽然起飞……本次分享将会结合案例，向大家分享生产中取得重大性能突破的一系列 SQL 改写优化妙手，来吧，快乐等着你！",
			"post": "梁敬彬 中电福富 特级专家",
			"jiabin": "福富研究院副理事长、公司四星级内训师；不仅是公司特级专家也是国内一线知名数据库专家，其个人及团队在数据库优化和培训领域有着丰富的经验、过硬的质量和良好的口碑；多次应邀担任国内外数据库大会的演讲嘉宾，在业界有着广泛的影响力；著有多本畅销数据库技术书籍，其代表作《收获，不止 Oracle》、《收获，不止 SQL 优化》等已成为数据库领域有口皆碑的经典书籍。<br>【讲师资质】<br>• 中国数据库技术大会5次演讲嘉宾<br>• Dataguru 金牌讲师<br>• 中电福富星级内训师<br>• OCP 金牌讲师<br>【 著作书籍】<br>•《 收获，不止 Oracle》<br>•《 收获， 不止 SQL 优化》<br>•《 收获， 不止 Oracle 2 版》-即将出版<br>• 此外还有合著的《 剑破冰山 - Oracle 开发艺术》、《 DBA 手记》 等书籍。"
		}
	]
}
